bjones1/pic24lib_all/lib/include/pic24_ports_tables.h
/*
 * "Copyright (c) 2008 Robert B. Reese, Bryan A. Jones, J. W. Bruce ("AUTHORS")"
 * All rights reserved.
 * (R. Reese, reese_AT_ece.msstate.edu, Mississippi State University)
 * (B. A. Jones, bjones_AT_ece.msstate.edu, Mississippi State University)
 * (J. W. Bruce, jwbruce_AT_ece.msstate.edu, Mississippi State University)
 *
 * Permission to use, copy, modify, and distribute this software and its
 * documentation for any purpose, without fee, and without written agreement is
 * hereby granted, provided that the above copyright notice, the following
 * two paragraphs and the authors appear in all copies of this software.
 *
 * IN NO EVENT SHALL THE "AUTHORS" BE LIABLE TO ANY PARTY FOR
 * DIRECT, INDIRECT, SPECIAL, INCIDENTAL, OR CONSEQUENTIAL DAMAGES ARISING OUT
 * OF THE USE OF THIS SOFTWARE AND ITS DOCUMENTATION, EVEN IF THE "AUTHORS"
 * HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 * THE "AUTHORS" SPECIFICALLY DISCLAIMS ANY WARRANTIES,
 * INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY
 * AND FITNESS FOR A PARTICULAR PURPOSE.  THE SOFTWARE PROVIDED HEREUNDER IS
 * ON AN "AS IS" BASIS, AND THE "AUTHORS" HAS NO OBLIGATION TO
 * PROVIDE MAINTENANCE, SUPPORT, UPDATES, ENHANCEMENTS, OR MODIFICATIONS."
 *
 * Please maintain this header in its entirety when copying/modifying
 * these files.
 *
 *
 */



#if 0
#elif defined(__PIC24F16KA102__)
# define RA0_GPIO -1, 0, 2
# define RA1_GPIO -1, 1, 3
# define RA2_GPIO -1, -1, 30
# define RA3_GPIO -1, -1, 29
# define RA4_GPIO -1, -1, 0
# define RB0_GPIO -1, 2, 4
# define RB1_GPIO -1, 3, 5
# define RB2_GPIO -1, 4, 6
# define RB3_GPIO -1, 5, 7
# define RB4_GPIO -1, -1, 1
# define RB5_GPIO -1, -1, 27
# define RB6_GPIO -1, -1, 24
# define RB7_GPIO -1, -1, 23
# define RB8_GPIO -1, -1, 22
# define RB9_GPIO -1, -1, 21
# define RB10_GPIO -1, -1, 16
# define RB11_GPIO -1, -1, 15
# define RB12_GPIO -1, 12, 14
# define RB13_GPIO -1, 11, 13
# define RB14_GPIO -1, 10, 12
# define RB15_GPIO -1, -1, 11
#elif defined(__dsPIC33FJ12GP201__)
# define RA0_GPIO -1, 0, 2
# define RA1_GPIO -1, 1, 3
# define RA2_GPIO -1, -1, 30
# define RA3_GPIO -1, -1, 29
# define RA4_GPIO -1, -1, 0
# define RB0_GPIO 0, 2, 4
# define RB1_GPIO 1, 3, 5
# define RB4_GPIO -1, -1, 1
# define RB7_GPIO -1, -1, 23
# define RB8_GPIO -1, -1, 22
# define RB9_GPIO -1, -1, 21
# define RB14_GPIO 14, 7, 12
# define RB15_GPIO 15, 6, 11
#elif defined(__dsPIC33FJ32GP202__)
# define RA0_GPIO -1, 0, 2
# define RA1_GPIO -1, 1, 3
# define RA2_GPIO -1, -1, 30
# define RA3_GPIO -1, -1, 29
# define RA4_GPIO -1, -1, 0
# define RB0_GPIO 0, 2, 4
# define RB1_GPIO 1, 3, 5
# define RB2_GPIO 2, 4, 6
# define RB3_GPIO 3, 5, 7
# define RB4_GPIO -1, -1, 1
# define RB5_GPIO -1, -1, 27
# define RB6_GPIO -1, -1, 24
# define RB7_GPIO -1, -1, 23
# define RB8_GPIO -1, -1, 22
# define RB9_GPIO -1, -1, 21
# define RB10_GPIO -1, -1, 16
# define RB11_GPIO -1, -1, 15
# define RB12_GPIO 12, 12, 14
# define RB13_GPIO 13, 11, 13
# define RB14_GPIO 14, 10, 12
# define RB15_GPIO 15, 9, 11
#elif defined(__dsPIC33FJ32GP302__)
# define RA0_GPIO -1, 0, 2
# define RA1_GPIO -1, 1, 3
# define RA2_GPIO -1, -1, 30
# define RA3_GPIO -1, -1, 29
# define RA4_GPIO -1, -1, 0
# define RB0_GPIO 0, 2, 4
# define RB1_GPIO 1, 3, 5
# define RB2_GPIO 2, 4, 6
# define RB3_GPIO 3, 5, 7
# define RB4_GPIO -1, -1, 1
# define RB5_GPIO -1, -1, 27
# define RB6_GPIO -1, -1, 24
# define RB7_GPIO -1, -1, 23
# define RB8_GPIO -1, -1, 22
# define RB9_GPIO -1, -1, 21
# define RB10_GPIO -1, -1, 16
# define RB11_GPIO -1, -1, 15
# define RB12_GPIO 12, 12, 14
# define RB13_GPIO 13, 11, 13
# define RB14_GPIO 14, 10, 12
# define RB15_GPIO 15, 9, 11
#elif defined(__dsPIC33FJ64GP202__)
# define RA0_GPIO -1, 0, 2
# define RA1_GPIO -1, 1, 3
# define RA2_GPIO -1, -1, 30
# define RA3_GPIO -1, -1, 29
# define RA4_GPIO -1, -1, 0
# define RB0_GPIO 0, 2, 4
# define RB1_GPIO 1, 3, 5
# define RB2_GPIO 2, 4, 6
# define RB3_GPIO 3, 5, 7
# define RB4_GPIO -1, -1, 1
# define RB5_GPIO -1, -1, 27
# define RB6_GPIO -1, -1, 24
# define RB7_GPIO -1, -1, 23
# define RB8_GPIO -1, -1, 22
# define RB9_GPIO -1, -1, 21
# define RB10_GPIO -1, -1, 16
# define RB11_GPIO -1, -1, 15
# define RB12_GPIO 12, 12, 14
# define RB13_GPIO 13, 11, 13
# define RB14_GPIO 14, 10, 12
# define RB15_GPIO 15, 9, 11
#elif defined(__dsPIC33FJ64GP802__)
# define RA0_GPIO -1, 0, 2
# define RA1_GPIO -1, 1, 3
# define RA2_GPIO -1, -1, 30
# define RA3_GPIO -1, -1, 29
# define RA4_GPIO -1, -1, 0
# define RB0_GPIO 0, 2, 4
# define RB1_GPIO 1, 3, 5
# define RB2_GPIO 2, 4, 6
# define RB3_GPIO 3, 5, 7
# define RB4_GPIO -1, -1, 1
# define RB5_GPIO -1, -1, 27
# define RB6_GPIO -1, -1, 24
# define RB7_GPIO -1, -1, 23
# define RB8_GPIO -1, -1, 22
# define RB9_GPIO -1, -1, 21
# define RB10_GPIO -1, -1, 16
# define RB11_GPIO -1, -1, 15
# define RB12_GPIO 12, 12, 14
# define RB13_GPIO 13, 11, 13
# define RB14_GPIO 14, 10, 12
# define RB15_GPIO 15, 9, 11
#elif defined(__dsPIC33FJ128GP202__)
# define RA0_GPIO -1, 0, 2
# define RA1_GPIO -1, 1, 3
# define RA2_GPIO -1, -1, 30
# define RA3_GPIO -1, -1, 29
# define RA4_GPIO -1, -1, 0
# define RB0_GPIO 0, 2, 4
# define RB1_GPIO 1, 3, 5
# define RB2_GPIO 2, 4, 6
# define RB3_GPIO 3, 5, 7
# define RB4_GPIO -1, -1, 1
# define RB5_GPIO -1, -1, 27
# define RB6_GPIO -1, -1, 24
# define RB7_GPIO -1, -1, 23
# define RB8_GPIO -1, -1, 22
# define RB9_GPIO -1, -1, 21
# define RB10_GPIO -1, -1, 16
# define RB11_GPIO -1, -1, 15
# define RB12_GPIO 12, 12, 14
# define RB13_GPIO 13, 11, 13
# define RB14_GPIO 14, 10, 12
# define RB15_GPIO 15, 9, 11
#elif defined(__dsPIC33FJ128GP802__)
# define RA0_GPIO -1, 0, 2
# define RA1_GPIO -1, 1, 3
# define RA2_GPIO -1, -1, 30
# define RA3_GPIO -1, -1, 29
# define RA4_GPIO -1, -1, 0
# define RB0_GPIO 0, 2, 4
# define RB1_GPIO 1, 3, 5
# define RB2_GPIO 2, 4, 6
# define RB3_GPIO 3, 5, 7
# define RB4_GPIO -1, -1, 1
# define RB5_GPIO -1, -1, 27
# define RB6_GPIO -1, -1, 24
# define RB7_GPIO -1, -1, 23
# define RB8_GPIO -1, -1, 22
# define RB9_GPIO -1, -1, 21
# define RB10_GPIO -1, -1, 16
# define RB11_GPIO -1, -1, 15
# define RB12_GPIO 12, 12, 14
# define RB13_GPIO 13, 11, 13
# define RB14_GPIO 14, 10, 12
# define RB15_GPIO 15, 9, 11
#elif defined(__dsPIC33FJ12GP202__)
# define RA0_GPIO -1, 0, 2
# define RA1_GPIO -1, 1, 3
# define RA2_GPIO -1, -1, 30
# define RA3_GPIO -1, -1, 29
# define RA4_GPIO -1, -1, 0
# define RB0_GPIO 0, 2, 4
# define RB1_GPIO 1, 3, 5
# define RB2_GPIO 2, 4, 6
# define RB3_GPIO 3, 5, 7
# define RB4_GPIO -1, -1, 1
# define RB5_GPIO -1, -1, 27
# define RB6_GPIO -1, -1, 24
# define RB7_GPIO -1, -1, 23
# define RB8_GPIO -1, -1, 22
# define RB9_GPIO -1, -1, 21
# define RB10_GPIO -1, -1, 16
# define RB11_GPIO -1, -1, 15
# define RB12_GPIO 12, 9, 14
# define RB13_GPIO 13, 8, 13
# define RB14_GPIO 14, 7, 12
# define RB15_GPIO 15, 6, 11
#elif defined(__dsPIC33FJ16GP304__)
# define RA0_GPIO -1, 0, 2
# define RA1_GPIO -1, 1, 3
# define RA2_GPIO -1, -1, 30
# define RA3_GPIO -1, -1, 29
# define RA4_GPIO -1, -1, 0
# define RB0_GPIO 0, 2, 4
# define RB1_GPIO 1, 3, 5
# define RB2_GPIO 2, 4, 6
# define RB3_GPIO 3, 5, 7
# define RB4_GPIO -1, -1, 1
# define RB5_GPIO -1, -1, 27
# define RB6_GPIO -1, -1, 24
# define RB7_GPIO -1, -1, 23
# define RB8_GPIO -1, -1, 22
# define RB9_GPIO -1, -1, 21
# define RB10_GPIO -1, -1, 16
# define RB11_GPIO -1, -1, 15
# define RB12_GPIO -1, -1, 14
# define RB13_GPIO 13, 11, 13
# define RB14_GPIO 14, 10, 12
# define RB15_GPIO 15, 9, 11
# define RC0_GPIO 16, 6, 8
# define RC1_GPIO 17, 7, 9
# define RC2_GPIO 18, 8, 10
# define RC3_GPIO -1, -1, 28
# define RC4_GPIO -1, -1, 25
# define RC5_GPIO -1, -1, 26
# define RC6_GPIO -1, -1, 18
# define RC7_GPIO -1, -1, 17
# define RC8_GPIO -1, -1, 20
# define RC9_GPIO -1, -1, 19
#elif defined(__dsPIC33FJ32GP204__)
# define RA0_GPIO -1, 0, 2
# define RA1_GPIO -1, 1, 3
# define RA2_GPIO -1, -1, 30
# define RA3_GPIO -1, -1, 29
# define RA4_GPIO -1, -1, 0
# define RB0_GPIO 0, 2, 4
# define RB1_GPIO 1, 3, 5
# define RB2_GPIO 2, 4, 6
# define RB3_GPIO 3, 5, 7
# define RB4_GPIO -1, -1, 1
# define RB5_GPIO -1, -1, 27
# define RB6_GPIO -1, -1, 24
# define RB7_GPIO -1, -1, 23
# define RB8_GPIO -1, -1, 22
# define RB9_GPIO -1, -1, 21
# define RB10_GPIO -1, -1, 16
# define RB11_GPIO -1, -1, 15
# define RB12_GPIO -1, -1, 14
# define RB13_GPIO 13, 11, 13
# define RB14_GPIO 14, 10, 12
# define RB15_GPIO 15, 9, 11
# define RC0_GPIO 16, 6, 8
# define RC1_GPIO 17, 7, 9
# define RC2_GPIO 18, 8, 10
# define RC3_GPIO -1, -1, 28
# define RC4_GPIO -1, -1, 25
# define RC5_GPIO -1, -1, 26
# define RC6_GPIO -1, -1, 18
# define RC7_GPIO -1, -1, 17
# define RC8_GPIO -1, -1, 20
# define RC9_GPIO -1, -1, 19
#elif defined(__dsPIC33FJ32GP304__)
# define RA0_GPIO -1, 0, 2
# define RA1_GPIO -1, 1, 3
# define RA2_GPIO -1, -1, 30
# define RA3_GPIO -1, -1, 29
# define RA4_GPIO -1, -1, 0
# define RB0_GPIO 0, 2, 4
# define RB1_GPIO 1, 3, 5
# define RB2_GPIO 2, 4, 6
# define RB3_GPIO 3, 5, 7
# define RB4_GPIO -1, -1, 1
# define RB5_GPIO -1, -1, 27
# define RB6_GPIO -1, -1, 24
# define RB7_GPIO -1, -1, 23
# define RB8_GPIO -1, -1, 22
# define RB9_GPIO -1, -1, 21
# define RB10_GPIO -1, -1, 16
# define RB11_GPIO -1, -1, 15
# define RB12_GPIO -1, -1, 14
# define RB13_GPIO 13, 11, 13
# define RB14_GPIO 14, 10, 12
# define RB15_GPIO 15, 9, 11
# define RC0_GPIO 16, 6, 8
# define RC1_GPIO 17, 7, 9
# define RC2_GPIO 18, 8, 10
# define RC3_GPIO -1, -1, 28
# define RC4_GPIO -1, -1, 25
# define RC5_GPIO -1, -1, 26
# define RC6_GPIO -1, -1, 18
# define RC7_GPIO -1, -1, 17
# define RC8_GPIO -1, -1, 20
# define RC9_GPIO -1, -1, 19
#elif defined(__dsPIC33FJ64GP204__)
# define RA0_GPIO -1, 0, 2
# define RA1_GPIO -1, 1, 3
# define RA2_GPIO -1, -1, 30
# define RA3_GPIO -1, -1, 29
# define RA4_GPIO -1, -1, 0
# define RB0_GPIO 0, 2, 4
# define RB1_GPIO 1, 3, 5
# define RB2_GPIO 2, 4, 6
# define RB3_GPIO 3, 5, 7
# define RB4_GPIO -1, -1, 1
# define RB5_GPIO -1, -1, 27
# define RB6_GPIO -1, -1, 24
# define RB7_GPIO -1, -1, 23
# define RB8_GPIO -1, -1, 22
# define RB9_GPIO -1, -1, 21
# define RB10_GPIO -1, -1, 16
# define RB11_GPIO -1, -1, 15
# define RB12_GPIO -1, -1, 14
# define RB13_GPIO 13, 11, 13
# define RB14_GPIO 14, 10, 12
# define RB15_GPIO 15, 9, 11
# define RC0_GPIO 16, 6, 8
# define RC1_GPIO 17, 7, 9
# define RC2_GPIO 18, 8, 10
# define RC3_GPIO -1, -1, 28
# define RC4_GPIO -1, -1, 25
# define RC5_GPIO -1, -1, 26
# define RC6_GPIO -1, -1, 18
# define RC7_GPIO -1, -1, 17
# define RC8_GPIO -1, -1, 20
# define RC9_GPIO -1, -1, 19
#elif defined(__dsPIC33FJ64GP804__)
# define RA0_GPIO -1, 0, 2
# define RA1_GPIO -1, 1, 3
# define RA2_GPIO -1, -1, 30
# define RA3_GPIO -1, -1, 29
# define RA4_GPIO -1, -1, 0
# define RB0_GPIO 0, 2, 4
# define RB1_GPIO 1, 3, 5
# define RB2_GPIO 2, 4, 6
# define RB3_GPIO 3, 5, 7
# define RB4_GPIO -1, -1, 1
# define RB5_GPIO -1, -1, 27
# define RB6_GPIO -1, -1, 24
# define RB7_GPIO -1, -1, 23
# define RB8_GPIO -1, -1, 22
# define RB9_GPIO -1, -1, 21
# define RB10_GPIO -1, -1, 16
# define RB11_GPIO -1, -1, 15
# define RB12_GPIO -1, -1, 14
# define RB13_GPIO 13, 11, 13
# define RB14_GPIO 14, 10, 12
# define RB15_GPIO 15, 9, 11
# define RC0_GPIO 16, 6, 8
# define RC1_GPIO 17, 7, 9
# define RC2_GPIO 18, 8, 10
# define RC3_GPIO -1, -1, 28
# define RC4_GPIO -1, -1, 25
# define RC5_GPIO -1, -1, 26
# define RC6_GPIO -1, -1, 18
# define RC7_GPIO -1, -1, 17
# define RC8_GPIO -1, -1, 20
# define RC9_GPIO -1, -1, 19
#elif defined(__dsPIC33FJ128GP204__)
# define RA0_GPIO -1, 0, 2
# define RA1_GPIO -1, 1, 3
# define RA2_GPIO -1, -1, 30
# define RA3_GPIO -1, -1, 29
# define RA4_GPIO -1, -1, 0
# define RB0_GPIO 0, 2, 4
# define RB1_GPIO 1, 3, 5
# define RB2_GPIO 2, 4, 6
# define RB3_GPIO 3, 5, 7
# define RB4_GPIO -1, -1, 1
# define RB5_GPIO -1, -1, 27
# define RB6_GPIO -1, -1, 24
# define RB7_GPIO -1, -1, 23
# define RB8_GPIO -1, -1, 22
# define RB9_GPIO -1, -1, 21
# define RB10_GPIO -1, -1, 16
# define RB11_GPIO -1, -1, 15
# define RB12_GPIO -1, -1, 14
# define RB13_GPIO 13, 11, 13
# define RB14_GPIO 14, 10, 12
# define RB15_GPIO 15, 9, 11
# define RC0_GPIO 16, 6, 8
# define RC1_GPIO 17, 7, 9
# define RC2_GPIO 18, 8, 10
# define RC3_GPIO -1, -1, 28
# define RC4_GPIO -1, -1, 25
# define RC5_GPIO -1, -1, 26
# define RC6_GPIO -1, -1, 18
# define RC7_GPIO -1, -1, 17
# define RC8_GPIO -1, -1, 20
# define RC9_GPIO -1, -1, 19
#elif defined(__dsPIC33FJ128GP804__)
# define RA0_GPIO -1, 0, 2
# define RA1_GPIO -1, 1, 3
# define RA2_GPIO -1, -1, 30
# define RA3_GPIO -1, -1, 29
# define RA4_GPIO -1, -1, 0
# define RB0_GPIO 0, 2, 4
# define RB1_GPIO 1, 3, 5
# define RB2_GPIO 2, 4, 6
# define RB3_GPIO 3, 5, 7
# define RB4_GPIO -1, -1, 1
# define RB5_GPIO -1, -1, 27
# define RB6_GPIO -1, -1, 24
# define RB7_GPIO -1, -1, 23
# define RB8_GPIO -1, -1, 22
# define RB9_GPIO -1, -1, 21
# define RB10_GPIO -1, -1, 16
# define RB11_GPIO -1, -1, 15
# define RB12_GPIO -1, -1, 14
# define RB13_GPIO 13, 11, 13
# define RB14_GPIO 14, 10, 12
# define RB15_GPIO 15, 9, 11
# define RC0_GPIO 16, 6, 8
# define RC1_GPIO 17, 7, 9
# define RC2_GPIO 18, 8, 10
# define RC3_GPIO -1, -1, 28
# define RC4_GPIO -1, -1, 25
# define RC5_GPIO -1, -1, 26
# define RC6_GPIO -1, -1, 18
# define RC7_GPIO -1, -1, 17
# define RC8_GPIO -1, -1, 20
# define RC9_GPIO -1, -1, 19
#elif defined(__PIC24EP64GP202__)
# define RA0_AN_PORT 0
# define RA1_AN_PORT 1
# define RB0_AN_PORT 2
# define RB1_AN_PORT 3
# define RB2_AN_PORT 4
# define RB3_AN_PORT 5
#elif defined(__dsPIC33EP64GP502__)
# define RA0_AN_PORT 0
# define RA1_AN_PORT 1
# define RB0_AN_PORT 2
# define RB1_AN_PORT 3
# define RB2_AN_PORT 4
# define RB3_AN_PORT 5
#elif defined(__PIC24EP64MC202__)
# define RA0_AN_PORT 0
# define RA1_AN_PORT 1
# define RB0_AN_PORT 2
# define RB1_AN_PORT 3
# define RB2_AN_PORT 4
# define RB3_AN_PORT 5
#elif defined(__dsPIC33EP64MC202__)
# define RA0_AN_PORT 0
# define RA1_AN_PORT 1
# define RB0_AN_PORT 2
# define RB1_AN_PORT 3
# define RB2_AN_PORT 4
# define RB3_AN_PORT 5
#elif defined(__dsPIC33EP64MC502__)
# define RA0_AN_PORT 0
# define RA1_AN_PORT 1
# define RB0_AN_PORT 2
# define RB1_AN_PORT 3
# define RB2_AN_PORT 4
# define RB3_AN_PORT 5
#elif defined(__PIC24EP32GP203__)
# define RA0_AN_PORT 0
# define RA1_AN_PORT 1
# define RB0_AN_PORT 2
# define RB1_AN_PORT 3
# define RB2_AN_PORT 4
# define RB3_AN_PORT 5
# define RC0_AN_PORT 6
# define RC1_AN_PORT 7
#elif defined(__PIC24EP64GP203__)
# define RA0_AN_PORT 0
# define RA1_AN_PORT 1
# define RB0_AN_PORT 2
# define RB1_AN_PORT 3
# define RB2_AN_PORT 4
# define RB3_AN_PORT 5
# define RC0_AN_PORT 6
# define RC1_AN_PORT 7
#elif defined(__dsPIC33EP32GP503__)
# define RA0_AN_PORT 0
# define RA1_AN_PORT 1
# define RB0_AN_PORT 2
# define RB1_AN_PORT 3
# define RB2_AN_PORT 4
# define RB3_AN_PORT 5
# define RC0_AN_PORT 6
# define RC1_AN_PORT 7
#elif defined(__dsPIC33EP64GP503__)
# define RA0_AN_PORT 0
# define RA1_AN_PORT 1
# define RB0_AN_PORT 2
# define RB1_AN_PORT 3
# define RB2_AN_PORT 4
# define RB3_AN_PORT 5
# define RC0_AN_PORT 6
# define RC1_AN_PORT 7
#elif defined(__PIC24EP32MC203__)
# define RA0_AN_PORT 0
# define RA1_AN_PORT 1
# define RB0_AN_PORT 2
# define RB1_AN_PORT 3
# define RB2_AN_PORT 4
# define RB3_AN_PORT 5
# define RC0_AN_PORT 6
# define RC1_AN_PORT 7
#elif defined(__PIC24EP64MC203__)
# define RA0_AN_PORT 0
# define RA1_AN_PORT 1
# define RB0_AN_PORT 2
# define RB1_AN_PORT 3
# define RB2_AN_PORT 4
# define RB3_AN_PORT 5
# define RC0_AN_PORT 6
# define RC1_AN_PORT 7
#elif defined(__PIC24EP32MC503__)
# define RA0_AN_PORT 0
# define RA1_AN_PORT 1
# define RB0_AN_PORT 2
# define RB1_AN_PORT 3
# define RB2_AN_PORT 4
# define RB3_AN_PORT 5
# define RC0_AN_PORT 6
# define RC1_AN_PORT 7
#elif defined(__PIC24EP64MC503__)
# define RA0_AN_PORT 0
# define RA1_AN_PORT 1
# define RB0_AN_PORT 2
# define RB1_AN_PORT 3
# define RB2_AN_PORT 4
# define RB3_AN_PORT 5
# define RC0_AN_PORT 6
# define RC1_AN_PORT 7
#elif defined(__dsPIC33EP32MC503__)
# define RA0_AN_PORT 0
# define RA1_AN_PORT 1
# define RB0_AN_PORT 2
# define RB1_AN_PORT 3
# define RB2_AN_PORT 4
# define RB3_AN_PORT 5
# define RC0_AN_PORT 6
# define RC1_AN_PORT 7
#elif defined(__dsPIC33EP64MC503__)
# define RA0_AN_PORT 0
# define RA1_AN_PORT 1
# define RB0_AN_PORT 2
# define RB1_AN_PORT 3
# define RB2_AN_PORT 4
# define RB3_AN_PORT 5
# define RC0_AN_PORT 6
# define RC1_AN_PORT 7
#elif defined(__dsPIC33EP32MC203__)
# define RA0_AN_PORT 0
# define RA1_AN_PORT 1
# define RB0_AN_PORT 2
# define RB1_AN_PORT 3
# define RB2_AN_PORT 4
# define RB3_AN_PORT 5
# define RC0_AN_PORT 6
# define RC1_AN_PORT 7
#elif defined(__dsPIC33EP64MC203__)
# define RA0_AN_PORT 0
# define RA1_AN_PORT 1
# define RB0_AN_PORT 2
# define RB1_AN_PORT 3
# define RB2_AN_PORT 4
# define RB3_AN_PORT 5
# define RC0_AN_PORT 6
# define RC1_AN_PORT 7
#elif defined(__PIC24EP32GP204__)
# define RA0_AN_PORT 0
# define RA1_AN_PORT 1
# define RB0_AN_PORT 2
# define RB1_AN_PORT 3
# define RB2_AN_PORT 4
# define RB3_AN_PORT 5
# define RC0_AN_PORT 6
# define RC1_AN_PORT 7
# define RC2_AN_PORT 8
#elif defined(__PIC24EP64GP204__)
# define RA0_AN_PORT 0
# define RA1_AN_PORT 1
# define RB0_AN_PORT 2
# define RB1_AN_PORT 3
# define RB2_AN_PORT 4
# define RB3_AN_PORT 5
# define RC0_AN_PORT 6
# define RC1_AN_PORT 7
# define RC2_AN_PORT 8
#elif defined(__PIC24EP128GP204__)
# define RA0_AN_PORT 0
# define RA1_AN_PORT 1
# define RB0_AN_PORT 2
# define RB1_AN_PORT 3
# define RB2_AN_PORT 4
# define RB3_AN_PORT 5
# define RC0_AN_PORT 6
# define RC1_AN_PORT 7
# define RC2_AN_PORT 8
#elif defined(__PIC24EP256GP204__)
# define RA0_AN_PORT 0
# define RA1_AN_PORT 1
# define RB0_AN_PORT 2
# define RB1_AN_PORT 3
# define RB2_AN_PORT 4
# define RB3_AN_PORT 5
# define RC0_AN_PORT 6
# define RC1_AN_PORT 7
# define RC2_AN_PORT 8
#elif defined(__PIC24EP512GP204__)
# define RA0_AN_PORT 0
# define RA1_AN_PORT 1
# define RB0_AN_PORT 2
# define RB1_AN_PORT 3
# define RB2_AN_PORT 4
# define RB3_AN_PORT 5
# define RC0_AN_PORT 6
# define RC1_AN_PORT 7
# define RC2_AN_PORT 8
#elif defined(__dsPIC33EP32GP504__)
# define RA0_AN_PORT 0
# define RA1_AN_PORT 1
# define RB0_AN_PORT 2
# define RB1_AN_PORT 3
# define RB2_AN_PORT 4
# define RB3_AN_PORT 5
# define RC0_AN_PORT 6
# define RC1_AN_PORT 7
# define RC2_AN_PORT 8
#elif defined(__dsPIC33EP64GP504__)
# define RA0_AN_PORT 0
# define RA1_AN_PORT 1
# define RB0_AN_PORT 2
# define RB1_AN_PORT 3
# define RB2_AN_PORT 4
# define RB3_AN_PORT 5
# define RC0_AN_PORT 6
# define RC1_AN_PORT 7
# define RC2_AN_PORT 8
#elif defined(__dsPIC33EP128GP504__)
# define RA0_AN_PORT 0
# define RA1_AN_PORT 1
# define RB0_AN_PORT 2
# define RB1_AN_PORT 3
# define RB2_AN_PORT 4
# define RB3_AN_PORT 5
# define RC0_AN_PORT 6
# define RC1_AN_PORT 7
# define RC2_AN_PORT 8
#elif defined(__dsPIC33EP256GP504__)
# define RA0_AN_PORT 0
# define RA1_AN_PORT 1
# define RB0_AN_PORT 2
# define RB1_AN_PORT 3
# define RB2_AN_PORT 4
# define RB3_AN_PORT 5
# define RC0_AN_PORT 6
# define RC1_AN_PORT 7
# define RC2_AN_PORT 8
#elif defined(__dsPIC33EP512GP504__)
# define RA0_AN_PORT 0
# define RA1_AN_PORT 1
# define RB0_AN_PORT 2
# define RB1_AN_PORT 3
# define RB2_AN_PORT 4
# define RB3_AN_PORT 5
# define RC0_AN_PORT 6
# define RC1_AN_PORT 7
# define RC2_AN_PORT 8
#elif defined(__PIC24EP32MC204__)
# define RA0_AN_PORT 0
# define RA1_AN_PORT 1
# define RB0_AN_PORT 2
# define RB1_AN_PORT 3
# define RB2_AN_PORT 4
# define RB3_AN_PORT 5
# define RC0_AN_PORT 6
# define RC1_AN_PORT 7
# define RC2_AN_PORT 8
#elif defined(__PIC24EP64MC204__)
# define RA0_AN_PORT 0
# define RA1_AN_PORT 1
# define RB0_AN_PORT 2
# define RB1_AN_PORT 3
# define RB2_AN_PORT 4
# define RB3_AN_PORT 5
# define RC0_AN_PORT 6
# define RC1_AN_PORT 7
# define RC2_AN_PORT 8
#elif defined(__PIC24EP128MC204__)
# define RA0_AN_PORT 0
# define RA1_AN_PORT 1
# define RB0_AN_PORT 2
# define RB1_AN_PORT 3
# define RB2_AN_PORT 4
# define RB3_AN_PORT 5
# define RC0_AN_PORT 6
# define RC1_AN_PORT 7
# define RC2_AN_PORT 8
#elif defined(__PIC24EP256MC204__)
# define RA0_AN_PORT 0
# define RA1_AN_PORT 1
# define RB0_AN_PORT 2
# define RB1_AN_PORT 3
# define RB2_AN_PORT 4
# define RB3_AN_PORT 5
# define RC0_AN_PORT 6
# define RC1_AN_PORT 7
# define RC2_AN_PORT 8
#elif defined(__PIC24EP512MC204__)
# define RA0_AN_PORT 0
# define RA1_AN_PORT 1
# define RB0_AN_PORT 2
# define RB1_AN_PORT 3
# define RB2_AN_PORT 4
# define RB3_AN_PORT 5
# define RC0_AN_PORT 6
# define RC1_AN_PORT 7
# define RC2_AN_PORT 8
#elif defined(__dsPIC33EP32MC504__)
# define RA0_AN_PORT 0
# define RA1_AN_PORT 1
# define RB0_AN_PORT 2
# define RB1_AN_PORT 3
# define RB2_AN_PORT 4
# define RB3_AN_PORT 5
# define RC0_AN_PORT 6
# define RC1_AN_PORT 7
# define RC2_AN_PORT 8
#elif defined(__dsPIC33EP64MC504__)
# define RA0_AN_PORT 0
# define RA1_AN_PORT 1
# define RB0_AN_PORT 2
# define RB1_AN_PORT 3
# define RB2_AN_PORT 4
# define RB3_AN_PORT 5
# define RC0_AN_PORT 6
# define RC1_AN_PORT 7
# define RC2_AN_PORT 8
#elif defined(__dsPIC33EP128MC504__)
# define RA0_AN_PORT 0
# define RA1_AN_PORT 1
# define RB0_AN_PORT 2
# define RB1_AN_PORT 3
# define RB2_AN_PORT 4
# define RB3_AN_PORT 5
# define RC0_AN_PORT 6
# define RC1_AN_PORT 7
# define RC2_AN_PORT 8
#elif defined(__dsPIC33EP256MC504__)
# define RA0_AN_PORT 0
# define RA1_AN_PORT 1
# define RB0_AN_PORT 2
# define RB1_AN_PORT 3
# define RB2_AN_PORT 4
# define RB3_AN_PORT 5
# define RC0_AN_PORT 6
# define RC1_AN_PORT 7
# define RC2_AN_PORT 8
#elif defined(__dsPIC33EP512MC504__)
# define RA0_AN_PORT 0
# define RA1_AN_PORT 1
# define RB0_AN_PORT 2
# define RB1_AN_PORT 3
# define RB2_AN_PORT 4
# define RB3_AN_PORT 5
# define RC0_AN_PORT 6
# define RC1_AN_PORT 7
# define RC2_AN_PORT 8
#elif defined(__dsPIC33EP32MC204__)
# define RA0_AN_PORT 0
# define RA1_AN_PORT 1
# define RB0_AN_PORT 2
# define RB1_AN_PORT 3
# define RB2_AN_PORT 4
# define RB3_AN_PORT 5
# define RC0_AN_PORT 6
# define RC1_AN_PORT 7
# define RC2_AN_PORT 8
#elif defined(__dsPIC33EP64MC204__)
# define RA0_AN_PORT 0
# define RA1_AN_PORT 1
# define RB0_AN_PORT 2
# define RB1_AN_PORT 3
# define RB2_AN_PORT 4
# define RB3_AN_PORT 5
# define RC0_AN_PORT 6
# define RC1_AN_PORT 7
# define RC2_AN_PORT 8
#elif defined(__dsPIC33EP128MC204__)
# define RA0_AN_PORT 0
# define RA1_AN_PORT 1
# define RB0_AN_PORT 2
# define RB1_AN_PORT 3
# define RB2_AN_PORT 4
# define RB3_AN_PORT 5
# define RC0_AN_PORT 6
# define RC1_AN_PORT 7
# define RC2_AN_PORT 8
#elif defined(__dsPIC33EP256MC204__)
# define RA0_AN_PORT 0
# define RA1_AN_PORT 1
# define RB0_AN_PORT 2
# define RB1_AN_PORT 3
# define RB2_AN_PORT 4
# define RB3_AN_PORT 5
# define RC0_AN_PORT 6
# define RC1_AN_PORT 7
# define RC2_AN_PORT 8
#elif defined(__dsPIC33EP512MC204__)
# define RA0_AN_PORT 0
# define RA1_AN_PORT 1
# define RB0_AN_PORT 2
# define RB1_AN_PORT 3
# define RB2_AN_PORT 4
# define RB3_AN_PORT 5
# define RC0_AN_PORT 6
# define RC1_AN_PORT 7
# define RC2_AN_PORT 8
#elif defined(__PIC24EP64GP206__)
# define RA0_AN_PORT 0
# define RA1_AN_PORT 1
# define RA11_AN_PORT 9
# define RA12_AN_PORT 10
# define RB0_AN_PORT 2
# define RB1_AN_PORT 3
# define RB2_AN_PORT 4
# define RB3_AN_PORT 5
# define RC0_AN_PORT 6
# define RC1_AN_PORT 7
# define RC2_AN_PORT 8
# define RC11_AN_PORT 11
# define RE12_AN_PORT 12
# define RE13_AN_PORT 13
# define RE14_AN_PORT 14
# define RE15_AN_PORT 15
#elif defined(__PIC24EP128GP206__)
# define RA0_AN_PORT 0
# define RA1_AN_PORT 1
# define RA11_AN_PORT 9
# define RA12_AN_PORT 10
# define RB0_AN_PORT 2
# define RB1_AN_PORT 3
# define RB2_AN_PORT 4
# define RB3_AN_PORT 5
# define RC0_AN_PORT 6
# define RC1_AN_PORT 7
# define RC2_AN_PORT 8
# define RC11_AN_PORT 11
# define RE12_AN_PORT 12
# define RE13_AN_PORT 13
# define RE14_AN_PORT 14
# define RE15_AN_PORT 15
#elif defined(__PIC24EP256GP206__)
# define RA0_AN_PORT 0
# define RA1_AN_PORT 1
# define RA11_AN_PORT 9
# define RA12_AN_PORT 10
# define RB0_AN_PORT 2
# define RB1_AN_PORT 3
# define RB2_AN_PORT 4
# define RB3_AN_PORT 5
# define RC0_AN_PORT 6
# define RC1_AN_PORT 7
# define RC2_AN_PORT 8
# define RC11_AN_PORT 11
# define RE12_AN_PORT 12
