bjones1/pic24lib_all/lib/include/pic24_ports_tables.h
# define RE13_AN_PORT 13
# define RE14_AN_PORT 14
# define RE15_AN_PORT 15
#elif defined(__PIC24EP512GP206__)
# define RA0_AN_PORT 0
# define RA1_AN_PORT 1
# define RA11_AN_PORT 9
# define RA12_AN_PORT 10
# define RB0_AN_PORT 2
# define RB1_AN_PORT 3
# define RB2_AN_PORT 4
# define RB3_AN_PORT 5
# define RC0_AN_PORT 6
# define RC1_AN_PORT 7
# define RC2_AN_PORT 8
# define RC11_AN_PORT 11
# define RE12_AN_PORT 12
# define RE13_AN_PORT 13
# define RE14_AN_PORT 14
# define RE15_AN_PORT 15
#elif defined(__dsPIC33EP64GP506__)
# define RA0_AN_PORT 0
# define RA1_AN_PORT 1
# define RA11_AN_PORT 9
# define RA12_AN_PORT 10
# define RB0_AN_PORT 2
# define RB1_AN_PORT 3
# define RB2_AN_PORT 4
# define RB3_AN_PORT 5
# define RC0_AN_PORT 6
# define RC1_AN_PORT 7
# define RC2_AN_PORT 8
# define RC11_AN_PORT 11
# define RE12_AN_PORT 12
# define RE13_AN_PORT 13
# define RE14_AN_PORT 14
# define RE15_AN_PORT 15
#elif defined(__dsPIC33EP128GP506__)
# define RA0_AN_PORT 0
# define RA1_AN_PORT 1
# define RA11_AN_PORT 9
# define RA12_AN_PORT 10
# define RB0_AN_PORT 2
# define RB1_AN_PORT 3
# define RB2_AN_PORT 4
# define RB3_AN_PORT 5
# define RC0_AN_PORT 6
# define RC1_AN_PORT 7
# define RC2_AN_PORT 8
# define RC11_AN_PORT 11
# define RE12_AN_PORT 12
# define RE13_AN_PORT 13
# define RE14_AN_PORT 14
# define RE15_AN_PORT 15
#elif defined(__dsPIC33EP256GP506__)
# define RA0_AN_PORT 0
# define RA1_AN_PORT 1
# define RA11_AN_PORT 9
# define RA12_AN_PORT 10
# define RB0_AN_PORT 2
# define RB1_AN_PORT 3
# define RB2_AN_PORT 4
# define RB3_AN_PORT 5
# define RC0_AN_PORT 6
# define RC1_AN_PORT 7
# define RC2_AN_PORT 8
# define RC11_AN_PORT 11
# define RE12_AN_PORT 12
# define RE13_AN_PORT 13
# define RE14_AN_PORT 14
# define RE15_AN_PORT 15
#elif defined(__dsPIC33EP512GP506__)
# define RA0_AN_PORT 0
# define RA1_AN_PORT 1
# define RA11_AN_PORT 9
# define RA12_AN_PORT 10
# define RB0_AN_PORT 2
# define RB1_AN_PORT 3
# define RB2_AN_PORT 4
# define RB3_AN_PORT 5
# define RC0_AN_PORT 6
# define RC1_AN_PORT 7
# define RC2_AN_PORT 8
# define RC11_AN_PORT 11
# define RE12_AN_PORT 12
# define RE13_AN_PORT 13
# define RE14_AN_PORT 14
# define RE15_AN_PORT 15
#elif defined(__PIC24EP64MC206__)
# define RA0_AN_PORT 0
# define RA1_AN_PORT 1
# define RA11_AN_PORT 9
# define RA12_AN_PORT 10
# define RB0_AN_PORT 2
# define RB1_AN_PORT 3
# define RB2_AN_PORT 4
# define RB3_AN_PORT 5
# define RC0_AN_PORT 6
# define RC1_AN_PORT 7
# define RC2_AN_PORT 8
# define RC11_AN_PORT 11
# define RE12_AN_PORT 12
# define RE13_AN_PORT 13
# define RE14_AN_PORT 14
# define RE15_AN_PORT 15
#elif defined(__PIC24EP128MC206__)
# define RA0_AN_PORT 0
# define RA1_AN_PORT 1
# define RA11_AN_PORT 9
# define RA12_AN_PORT 10
# define RB0_AN_PORT 2
# define RB1_AN_PORT 3
# define RB2_AN_PORT 4
# define RB3_AN_PORT 5
# define RC0_AN_PORT 6
# define RC1_AN_PORT 7
# define RC2_AN_PORT 8
# define RC11_AN_PORT 11
# define RE12_AN_PORT 12
# define RE13_AN_PORT 13
# define RE14_AN_PORT 14
# define RE15_AN_PORT 15
#elif defined(__PIC24EP256MC206__)
# define RA0_AN_PORT 0
# define RA1_AN_PORT 1
# define RA11_AN_PORT 9
# define RA12_AN_PORT 10
# define RB0_AN_PORT 2
# define RB1_AN_PORT 3
# define RB2_AN_PORT 4
# define RB3_AN_PORT 5
# define RC0_AN_PORT 6
# define RC1_AN_PORT 7
# define RC2_AN_PORT 8
# define RC11_AN_PORT 11
# define RE12_AN_PORT 12
# define RE13_AN_PORT 13
# define RE14_AN_PORT 14
# define RE15_AN_PORT 15
#elif defined(__PIC24EP512MC206__)
# define RA0_AN_PORT 0
# define RA1_AN_PORT 1
# define RA11_AN_PORT 9
# define RA12_AN_PORT 10
# define RB0_AN_PORT 2
# define RB1_AN_PORT 3
# define RB2_AN_PORT 4
# define RB3_AN_PORT 5
# define RC0_AN_PORT 6
# define RC1_AN_PORT 7
# define RC2_AN_PORT 8
# define RC11_AN_PORT 11
# define RE12_AN_PORT 12
# define RE13_AN_PORT 13
# define RE14_AN_PORT 14
# define RE15_AN_PORT 15
#elif defined(__dsPIC33EP64MC206__)
# define RA0_AN_PORT 0
# define RA1_AN_PORT 1
# define RA11_AN_PORT 9
# define RA12_AN_PORT 10
# define RB0_AN_PORT 2
# define RB1_AN_PORT 3
# define RB2_AN_PORT 4
# define RB3_AN_PORT 5
# define RC0_AN_PORT 6
# define RC1_AN_PORT 7
# define RC2_AN_PORT 8
# define RC11_AN_PORT 11
# define RE12_AN_PORT 12
# define RE13_AN_PORT 13
# define RE14_AN_PORT 14
# define RE15_AN_PORT 15
#elif defined(__dsPIC33EP128MC206__)
# define RA0_AN_PORT 0
# define RA1_AN_PORT 1
# define RA11_AN_PORT 9
# define RA12_AN_PORT 10
# define RB0_AN_PORT 2
# define RB1_AN_PORT 3
# define RB2_AN_PORT 4
# define RB3_AN_PORT 5
# define RC0_AN_PORT 6
# define RC1_AN_PORT 7
# define RC2_AN_PORT 8
# define RC11_AN_PORT 11
# define RE12_AN_PORT 12
# define RE13_AN_PORT 13
# define RE14_AN_PORT 14
# define RE15_AN_PORT 15
#elif defined(__dsPIC33EP256MC206__)
# define RA0_AN_PORT 0
# define RA1_AN_PORT 1
# define RA11_AN_PORT 9
# define RA12_AN_PORT 10
# define RB0_AN_PORT 2
# define RB1_AN_PORT 3
# define RB2_AN_PORT 4
# define RB3_AN_PORT 5
# define RC0_AN_PORT 6
# define RC1_AN_PORT 7
# define RC2_AN_PORT 8
# define RC11_AN_PORT 11
# define RE12_AN_PORT 12
# define RE13_AN_PORT 13
# define RE14_AN_PORT 14
# define RE15_AN_PORT 15
#elif defined(__dsPIC33EP512MC206__)
# define RA0_AN_PORT 0
# define RA1_AN_PORT 1
# define RA11_AN_PORT 9
# define RA12_AN_PORT 10
# define RB0_AN_PORT 2
# define RB1_AN_PORT 3
# define RB2_AN_PORT 4
# define RB3_AN_PORT 5
# define RC0_AN_PORT 6
# define RC1_AN_PORT 7
# define RC2_AN_PORT 8
# define RC11_AN_PORT 11
# define RE12_AN_PORT 12
# define RE13_AN_PORT 13
# define RE14_AN_PORT 14
# define RE15_AN_PORT 15
#elif defined(__dsPIC33EP64MC506__)
# define RA0_AN_PORT 0
# define RA1_AN_PORT 1
# define RA11_AN_PORT 9
# define RA12_AN_PORT 10
# define RB0_AN_PORT 2
# define RB1_AN_PORT 3
# define RB2_AN_PORT 4
# define RB3_AN_PORT 5
# define RC0_AN_PORT 6
# define RC1_AN_PORT 7
# define RC2_AN_PORT 8
# define RC11_AN_PORT 11
# define RE12_AN_PORT 12
# define RE13_AN_PORT 13
# define RE14_AN_PORT 14
# define RE15_AN_PORT 15
#elif defined(__dsPIC33EP128MC506__)
# define RA0_AN_PORT 0
# define RA1_AN_PORT 1
# define RA11_AN_PORT 9
# define RA12_AN_PORT 10
# define RB0_AN_PORT 2
# define RB1_AN_PORT 3
# define RB2_AN_PORT 4
# define RB3_AN_PORT 5
# define RC0_AN_PORT 6
# define RC1_AN_PORT 7
# define RC2_AN_PORT 8
# define RC11_AN_PORT 11
# define RE12_AN_PORT 12
# define RE13_AN_PORT 13
# define RE14_AN_PORT 14
# define RE15_AN_PORT 15
#elif defined(__dsPIC33EP256MC506__)
# define RA0_AN_PORT 0
# define RA1_AN_PORT 1
# define RA11_AN_PORT 9
# define RA12_AN_PORT 10
# define RB0_AN_PORT 2
# define RB1_AN_PORT 3
# define RB2_AN_PORT 4
# define RB3_AN_PORT 5
# define RC0_AN_PORT 6
# define RC1_AN_PORT 7
# define RC2_AN_PORT 8
# define RC11_AN_PORT 11
# define RE12_AN_PORT 12
# define RE13_AN_PORT 13
# define RE14_AN_PORT 14
# define RE15_AN_PORT 15
#elif defined(__dsPIC33EP512MC506__)
# define RA0_AN_PORT 0
# define RA1_AN_PORT 1
# define RA11_AN_PORT 9
# define RA12_AN_PORT 10
# define RB0_AN_PORT 2
# define RB1_AN_PORT 3
# define RB2_AN_PORT 4
# define RB3_AN_PORT 5
# define RC0_AN_PORT 6
# define RC1_AN_PORT 7
# define RC2_AN_PORT 8
# define RC11_AN_PORT 11
# define RE12_AN_PORT 12
# define RE13_AN_PORT 13
# define RE14_AN_PORT 14
# define RE15_AN_PORT 15
#elif defined(__dsPIC33EP256MU806__)
# define RB0_AN_PORT 0
# define RB1_AN_PORT 1
# define RB2_AN_PORT 2
# define RB3_AN_PORT 3
# define RB4_AN_PORT 4
# define RB5_AN_PORT 5
# define RB6_AN_PORT 6
# define RB7_AN_PORT 7
# define RB8_AN_PORT 8
# define RB9_AN_PORT 9
# define RB10_AN_PORT 10
# define RB11_AN_PORT 11
# define RB12_AN_PORT 12
# define RB13_AN_PORT 13
# define RB14_AN_PORT 14
# define RB15_AN_PORT 15
# define RE0_AN_PORT 24
# define RE1_AN_PORT 25
# define RE2_AN_PORT 26
# define RE3_AN_PORT 27
# define RE4_AN_PORT 28
# define RE5_AN_PORT 29
# define RE6_AN_PORT 30
# define RE7_AN_PORT 31
#elif defined(__dsPIC33EP512MU806__)
# define RB0_AN_PORT 0
# define RB1_AN_PORT 1
# define RB2_AN_PORT 2
# define RB3_AN_PORT 3
# define RB4_AN_PORT 4
# define RB5_AN_PORT 5
# define RB6_AN_PORT 6
# define RB7_AN_PORT 7
# define RB8_AN_PORT 8
# define RB9_AN_PORT 9
# define RB10_AN_PORT 10
# define RB11_AN_PORT 11
# define RB12_AN_PORT 12
# define RB13_AN_PORT 13
# define RB14_AN_PORT 14
# define RB15_AN_PORT 15
# define RE0_AN_PORT 24
# define RE1_AN_PORT 25
# define RE2_AN_PORT 26
# define RE3_AN_PORT 27
# define RE4_AN_PORT 28
# define RE5_AN_PORT 29
# define RE6_AN_PORT 30
# define RE7_AN_PORT 31
#elif defined(__dsPIC33EP512GP806__)
# define RB0_AN_PORT 0
# define RB1_AN_PORT 1
# define RB2_AN_PORT 2
# define RB3_AN_PORT 3
# define RB4_AN_PORT 4
# define RB5_AN_PORT 5
# define RB6_AN_PORT 6
# define RB7_AN_PORT 7
# define RB8_AN_PORT 8
# define RB9_AN_PORT 9
# define RB10_AN_PORT 10
# define RB11_AN_PORT 11
# define RB12_AN_PORT 12
# define RB13_AN_PORT 13
# define RB14_AN_PORT 14
# define RB15_AN_PORT 15
# define RE0_AN_PORT 24
# define RE1_AN_PORT 25
# define RE2_AN_PORT 26
# define RE3_AN_PORT 27
# define RE4_AN_PORT 28
# define RE5_AN_PORT 29
# define RE6_AN_PORT 30
# define RE7_AN_PORT 31
#elif defined(__PIC24EP512GP806__)
# define RB0_AN_PORT 0
# define RB1_AN_PORT 1
# define RB2_AN_PORT 2
# define RB3_AN_PORT 3
# define RB4_AN_PORT 4
# define RB5_AN_PORT 5
# define RB6_AN_PORT 6
# define RB7_AN_PORT 7
# define RB8_AN_PORT 8
# define RB9_AN_PORT 9
# define RB10_AN_PORT 10
# define RB11_AN_PORT 11
# define RB12_AN_PORT 12
# define RB13_AN_PORT 13
# define RB14_AN_PORT 14
# define RB15_AN_PORT 15
# define RE0_AN_PORT 24
# define RE1_AN_PORT 25
# define RE2_AN_PORT 26
# define RE3_AN_PORT 27
# define RE4_AN_PORT 28
# define RE5_AN_PORT 29
# define RE6_AN_PORT 30
# define RE7_AN_PORT 31
#elif defined(__dsPIC33EP512MC806__)
# define RB0_AN_PORT 0
# define RB1_AN_PORT 1
# define RB2_AN_PORT 2
# define RB3_AN_PORT 3
# define RB4_AN_PORT 4
# define RB5_AN_PORT 5
# define RB6_AN_PORT 6
# define RB7_AN_PORT 7
# define RB8_AN_PORT 8
# define RB9_AN_PORT 9
# define RB10_AN_PORT 10
# define RB11_AN_PORT 11
# define RB12_AN_PORT 12
# define RB13_AN_PORT 13
# define RB14_AN_PORT 14
# define RB15_AN_PORT 15
# define RE0_AN_PORT 24
# define RE1_AN_PORT 25
# define RE2_AN_PORT 26
# define RE3_AN_PORT 27
# define RE4_AN_PORT 28
# define RE5_AN_PORT 29
# define RE6_AN_PORT 30
# define RE7_AN_PORT 31
#elif defined(__dsPIC33EP512MU810__)
# define RA6_AN_PORT 22
# define RA7_AN_PORT 23
# define RB0_AN_PORT 0
# define RB1_AN_PORT 1
# define RB2_AN_PORT 2
# define RB3_AN_PORT 3
# define RB4_AN_PORT 4
# define RB5_AN_PORT 5
# define RB6_AN_PORT 6
# define RB7_AN_PORT 7
# define RB8_AN_PORT 8
# define RB9_AN_PORT 9
# define RB10_AN_PORT 10
# define RB11_AN_PORT 11
# define RB12_AN_PORT 12
# define RB13_AN_PORT 13
# define RB14_AN_PORT 14
# define RB15_AN_PORT 15
# define RC1_AN_PORT 16
# define RC2_AN_PORT 17
# define RC3_AN_PORT 18
# define RC4_AN_PORT 19
# define RE0_AN_PORT 24
# define RE1_AN_PORT 25
# define RE2_AN_PORT 26
# define RE3_AN_PORT 27
# define RE4_AN_PORT 28
# define RE5_AN_PORT 29
# define RE6_AN_PORT 30
# define RE7_AN_PORT 31
# define RE8_AN_PORT 20
# define RE9_AN_PORT 21
#elif defined(__dsPIC33EP256MU810__)
# define RA6_AN_PORT 22
# define RA7_AN_PORT 23
# define RB0_AN_PORT 0
# define RB1_AN_PORT 1
# define RB2_AN_PORT 2
# define RB3_AN_PORT 3
# define RB4_AN_PORT 4
# define RB5_AN_PORT 5
# define RB6_AN_PORT 6
# define RB7_AN_PORT 7
# define RB8_AN_PORT 8
# define RB9_AN_PORT 9
# define RB10_AN_PORT 10
# define RB11_AN_PORT 11
# define RB12_AN_PORT 12
# define RB13_AN_PORT 13
# define RB14_AN_PORT 14
# define RB15_AN_PORT 15
# define RC1_AN_PORT 16
# define RC2_AN_PORT 17
# define RC3_AN_PORT 18
# define RC4_AN_PORT 19
# define RE0_AN_PORT 24
# define RE1_AN_PORT 25
# define RE2_AN_PORT 26
# define RE3_AN_PORT 27
# define RE4_AN_PORT 28
# define RE5_AN_PORT 29
# define RE6_AN_PORT 30
# define RE7_AN_PORT 31
# define RE8_AN_PORT 20
# define RE9_AN_PORT 21
#elif defined(__PIC24EP512GU810__)
# define RA6_AN_PORT 22
# define RA7_AN_PORT 23
# define RB0_AN_PORT 0
# define RB1_AN_PORT 1
# define RB2_AN_PORT 2
# define RB3_AN_PORT 3
# define RB4_AN_PORT 4
# define RB5_AN_PORT 5
# define RB6_AN_PORT 6
# define RB7_AN_PORT 7
# define RB8_AN_PORT 8
# define RB9_AN_PORT 9
# define RB10_AN_PORT 10
# define RB11_AN_PORT 11
# define RB12_AN_PORT 12
# define RB13_AN_PORT 13
# define RB14_AN_PORT 14
# define RB15_AN_PORT 15
# define RC1_AN_PORT 16
# define RC2_AN_PORT 17
# define RC3_AN_PORT 18
# define RC4_AN_PORT 19
# define RE0_AN_PORT 24
# define RE1_AN_PORT 25
# define RE2_AN_PORT 26
# define RE3_AN_PORT 27
# define RE4_AN_PORT 28
# define RE5_AN_PORT 29
# define RE6_AN_PORT 30
# define RE7_AN_PORT 31
# define RE8_AN_PORT 20
# define RE9_AN_PORT 21
#elif defined(__PIC24EP256GU810__)
# define RA6_AN_PORT 22
# define RA7_AN_PORT 23
# define RB0_AN_PORT 0
# define RB1_AN_PORT 1
# define RB2_AN_PORT 2
# define RB3_AN_PORT 3
# define RB4_AN_PORT 4
# define RB5_AN_PORT 5
# define RB6_AN_PORT 6
# define RB7_AN_PORT 7
# define RB8_AN_PORT 8
# define RB9_AN_PORT 9
# define RB10_AN_PORT 10
# define RB11_AN_PORT 11
# define RB12_AN_PORT 12
# define RB13_AN_PORT 13
# define RB14_AN_PORT 14
# define RB15_AN_PORT 15
# define RC1_AN_PORT 16
# define RC2_AN_PORT 17
# define RC3_AN_PORT 18
# define RC4_AN_PORT 19
# define RE0_AN_PORT 24
# define RE1_AN_PORT 25
# define RE2_AN_PORT 26
# define RE3_AN_PORT 27
# define RE4_AN_PORT 28
# define RE5_AN_PORT 29
# define RE6_AN_PORT 30
# define RE7_AN_PORT 31
# define RE8_AN_PORT 20
# define RE9_AN_PORT 21
#elif defined(__dsPIC33EP512MU814__)
# define RA6_AN_PORT 22
# define RA7_AN_PORT 23
# define RB0_AN_PORT 0
# define RB1_AN_PORT 1
# define RB2_AN_PORT 2
# define RB3_AN_PORT 3
# define RB4_AN_PORT 4
# define RB5_AN_PORT 5
# define RB6_AN_PORT 6
# define RB7_AN_PORT 7
# define RB8_AN_PORT 8
# define RB9_AN_PORT 9
# define RB10_AN_PORT 10
# define RB11_AN_PORT 11
# define RB12_AN_PORT 12
# define RB13_AN_PORT 13
# define RB14_AN_PORT 14
# define RB15_AN_PORT 15
# define RC1_AN_PORT 16
# define RC2_AN_PORT 17
# define RC3_AN_PORT 18
# define RC4_AN_PORT 19
# define RE0_AN_PORT 24
# define RE1_AN_PORT 25
# define RE2_AN_PORT 26
# define RE3_AN_PORT 27
# define RE4_AN_PORT 28
# define RE5_AN_PORT 29
# define RE6_AN_PORT 30
# define RE7_AN_PORT 31
# define RE8_AN_PORT 20
# define RE9_AN_PORT 21
#elif defined(__dsPIC33EP256MU814__)
# define RA6_AN_PORT 22
# define RA7_AN_PORT 23
# define RB0_AN_PORT 0
# define RB1_AN_PORT 1
# define RB2_AN_PORT 2
# define RB3_AN_PORT 3
# define RB4_AN_PORT 4
# define RB5_AN_PORT 5
# define RB6_AN_PORT 6
# define RB7_AN_PORT 7
# define RB8_AN_PORT 8
# define RB9_AN_PORT 9
# define RB10_AN_PORT 10
# define RB11_AN_PORT 11
# define RB12_AN_PORT 12
# define RB13_AN_PORT 13
# define RB14_AN_PORT 14
# define RB15_AN_PORT 15
# define RC1_AN_PORT 16
# define RC2_AN_PORT 17
# define RC3_AN_PORT 18
# define RC4_AN_PORT 19
# define RE0_AN_PORT 24
# define RE1_AN_PORT 25
# define RE2_AN_PORT 26
# define RE3_AN_PORT 27
# define RE4_AN_PORT 28
# define RE5_AN_PORT 29
# define RE6_AN_PORT 30
# define RE7_AN_PORT 31
# define RE8_AN_PORT 20
# define RE9_AN_PORT 21
#elif defined(__PIC24EP512GU814__)
# define RA6_AN_PORT 22
# define RA7_AN_PORT 23
# define RB0_AN_PORT 0
# define RB1_AN_PORT 1
# define RB2_AN_PORT 2
# define RB3_AN_PORT 3
# define RB4_AN_PORT 4
# define RB5_AN_PORT 5
# define RB6_AN_PORT 6
# define RB7_AN_PORT 7
# define RB8_AN_PORT 8
# define RB9_AN_PORT 9
# define RB10_AN_PORT 10
# define RB11_AN_PORT 11
# define RB12_AN_PORT 12
# define RB13_AN_PORT 13
# define RB14_AN_PORT 14
# define RB15_AN_PORT 15
# define RC1_AN_PORT 16
# define RC2_AN_PORT 17
# define RC3_AN_PORT 18
# define RC4_AN_PORT 19
# define RE0_AN_PORT 24
# define RE1_AN_PORT 25
# define RE2_AN_PORT 26
# define RE3_AN_PORT 27
# define RE4_AN_PORT 28
# define RE5_AN_PORT 29
# define RE6_AN_PORT 30
# define RE7_AN_PORT 31
# define RE8_AN_PORT 20
# define RE9_AN_PORT 21
#elif defined(__PIC24EP256GU814__)
# define RA6_AN_PORT 22
# define RA7_AN_PORT 23
# define RB0_AN_PORT 0
# define RB1_AN_PORT 1
# define RB2_AN_PORT 2
# define RB3_AN_PORT 3
# define RB4_AN_PORT 4
# define RB5_AN_PORT 5
# define RB6_AN_PORT 6
# define RB7_AN_PORT 7
# define RB8_AN_PORT 8
# define RB9_AN_PORT 9
# define RB10_AN_PORT 10
# define RB11_AN_PORT 11
# define RB12_AN_PORT 12
# define RB13_AN_PORT 13
# define RB14_AN_PORT 14
# define RB15_AN_PORT 15
# define RC1_AN_PORT 16
# define RC2_AN_PORT 17
# define RC3_AN_PORT 18
# define RC4_AN_PORT 19
# define RE0_AN_PORT 24
# define RE1_AN_PORT 25
# define RE2_AN_PORT 26
# define RE3_AN_PORT 27
# define RE4_AN_PORT 28
# define RE5_AN_PORT 29
# define RE6_AN_PORT 30
# define RE7_AN_PORT 31
# define RE8_AN_PORT 20
# define RE9_AN_PORT 21
#elif defined(__PIC24HJ12GP201__)
# define RA0_GPIO -1, 0, 2
# define RA1_GPIO -1, 1, 3
# define RA2_GPIO -1, -1, 30
# define RA3_GPIO -1, -1, 29
# define RA4_GPIO -1, -1, 0
# define RB0_GPIO 0, 2, 4
# define RB1_GPIO 1, 3, 5
# define RB4_GPIO -1, -1, 1
# define RB7_GPIO -1, -1, 23
# define RB8_GPIO -1, -1, 22
# define RB9_GPIO -1, -1, 21
# define RB14_GPIO 14, 7, 12
# define RB15_GPIO 15, 6, 11
#elif defined(__PIC24HJ32GP202__)
# define RA0_GPIO -1, 0, 2
# define RA1_GPIO -1, 1, 3
# define RA2_GPIO -1, -1, 30
# define RA3_GPIO -1, -1, 29
# define RA4_GPIO -1, -1, 0
# define RB0_GPIO 0, 2, 4
# define RB1_GPIO 1, 3, 5
# define RB2_GPIO 2, 4, 6
# define RB3_GPIO 3, 5, 7
# define RB4_GPIO -1, -1, 1
# define RB5_GPIO -1, -1, 27
# define RB6_GPIO -1, -1, 24
# define RB7_GPIO -1, -1, 23
# define RB8_GPIO -1, -1, 22
# define RB9_GPIO -1, -1, 21
# define RB10_GPIO -1, -1, 16
# define RB11_GPIO -1, -1, 15
# define RB12_GPIO 12, 12, 14
# define RB13_GPIO 13, 11, 13
# define RB14_GPIO 14, 10, 12
# define RB15_GPIO 15, 9, 11
#elif defined(__PIC24HJ32GP302__)
# define RA0_GPIO -1, 0, 2
# define RA1_GPIO -1, 1, 3
# define RA2_GPIO -1, -1, 30
# define RA3_GPIO -1, -1, 29
# define RA4_GPIO -1, -1, 0
# define RB0_GPIO 0, 2, 4
# define RB1_GPIO 1, 3, 5
# define RB2_GPIO 2, 4, 6
# define RB3_GPIO 3, 5, 7
# define RB4_GPIO -1, -1, 1
# define RB5_GPIO -1, -1, 27
# define RB6_GPIO -1, -1, 24
# define RB7_GPIO -1, -1, 23
# define RB8_GPIO -1, -1, 22
# define RB9_GPIO -1, -1, 21
# define RB10_GPIO -1, -1, 16
# define RB11_GPIO -1, -1, 15
# define RB12_GPIO 12, 12, 14
# define RB13_GPIO 13, 11, 13
# define RB14_GPIO 14, 10, 12
# define RB15_GPIO 15, 9, 11
#elif defined(__PIC24HJ64GP202__)
# define RA0_GPIO -1, 0, 2
# define RA1_GPIO -1, 1, 3
# define RA2_GPIO -1, -1, 30
# define RA3_GPIO -1, -1, 29
# define RA4_GPIO -1, -1, 0
# define RB0_GPIO 0, 2, 4
# define RB1_GPIO 1, 3, 5
# define RB2_GPIO 2, 4, 6
# define RB3_GPIO 3, 5, 7
# define RB4_GPIO -1, -1, 1
# define RB5_GPIO -1, -1, 27
# define RB6_GPIO -1, -1, 24
# define RB7_GPIO -1, -1, 23
# define RB8_GPIO -1, -1, 22
# define RB9_GPIO -1, -1, 21
# define RB10_GPIO -1, -1, 16
# define RB11_GPIO -1, -1, 15
# define RB12_GPIO 12, 12, 14
# define RB13_GPIO 13, 11, 13
# define RB14_GPIO 14, 10, 12
# define RB15_GPIO 15, 9, 11
#elif defined(__PIC24HJ64GP502__)
# define RA0_GPIO -1, 0, 2
# define RA1_GPIO -1, 1, 3
# define RA2_GPIO -1, -1, 30
# define RA3_GPIO -1, -1, 29
# define RA4_GPIO -1, -1, 0
# define RB0_GPIO 0, 2, 4
# define RB1_GPIO 1, 3, 5
# define RB2_GPIO 2, 4, 6
# define RB3_GPIO 3, 5, 7
# define RB4_GPIO -1, -1, 1
# define RB5_GPIO -1, -1, 27
# define RB6_GPIO -1, -1, 24
# define RB7_GPIO -1, -1, 23
# define RB8_GPIO -1, -1, 22
# define RB9_GPIO -1, -1, 21
# define RB10_GPIO -1, -1, 16
# define RB11_GPIO -1, -1, 15
# define RB12_GPIO 12, 12, 14
# define RB13_GPIO 13, 11, 13
# define RB14_GPIO 14, 10, 12
# define RB15_GPIO 15, 9, 11
#elif defined(__PIC24HJ128GP202__)
# define RA0_GPIO -1, 0, 2
# define RA1_GPIO -1, 1, 3
# define RA2_GPIO -1, -1, 30
# define RA3_GPIO -1, -1, 29
# define RA4_GPIO -1, -1, 0
# define RB0_GPIO 0, 2, 4
# define RB1_GPIO 1, 3, 5
# define RB2_GPIO 2, 4, 6
# define RB3_GPIO 3, 5, 7
# define RB4_GPIO -1, -1, 1
# define RB5_GPIO -1, -1, 27
# define RB6_GPIO -1, -1, 24
# define RB7_GPIO -1, -1, 23
# define RB8_GPIO -1, -1, 22
# define RB9_GPIO -1, -1, 21
# define RB10_GPIO -1, -1, 16
# define RB11_GPIO -1, -1, 15
# define RB12_GPIO 12, 12, 14
# define RB13_GPIO 13, 11, 13
# define RB14_GPIO 14, 10, 12
# define RB15_GPIO 15, 9, 11
#elif defined(__PIC24HJ128GP502__)
# define RA0_GPIO -1, 0, 2
# define RA1_GPIO -1, 1, 3
# define RA2_GPIO -1, -1, 30
# define RA3_GPIO -1, -1, 29
# define RA4_GPIO -1, -1, 0
# define RB0_GPIO 0, 2, 4
# define RB1_GPIO 1, 3, 5
# define RB2_GPIO 2, 4, 6
# define RB3_GPIO 3, 5, 7
# define RB4_GPIO -1, -1, 1
# define RB5_GPIO -1, -1, 27
# define RB6_GPIO -1, -1, 24
# define RB7_GPIO -1, -1, 23
# define RB8_GPIO -1, -1, 22
# define RB9_GPIO -1, -1, 21
# define RB10_GPIO -1, -1, 16
# define RB11_GPIO -1, -1, 15
# define RB12_GPIO 12, 12, 14
# define RB13_GPIO 13, 11, 13
# define RB14_GPIO 14, 10, 12
# define RB15_GPIO 15, 9, 11
#elif defined(__PIC24HJ12GP202__)
# define RA0_GPIO -1, 0, 2
# define RA1_GPIO -1, 1, 3
# define RA2_GPIO -1, -1, 30
# define RA3_GPIO -1, -1, 29
# define RA4_GPIO -1, -1, 0
# define RB0_GPIO 0, 2, 4
# define RB1_GPIO 1, 3, 5
# define RB2_GPIO 2, 4, 6
# define RB3_GPIO 3, 5, 7
# define RB4_GPIO -1, -1, 1
# define RB5_GPIO -1, -1, 27
# define RB6_GPIO -1, -1, 24
# define RB7_GPIO -1, -1, 23
# define RB8_GPIO -1, -1, 22
# define RB9_GPIO -1, -1, 21
# define RB10_GPIO -1, -1, 16
# define RB11_GPIO -1, -1, 15
# define RB12_GPIO 12, 9, 14
# define RB13_GPIO 13, 8, 13
# define RB14_GPIO 14, 7, 12
# define RB15_GPIO 15, 6, 11
#elif defined(__PIC24HJ16GP304__)
# define RA0_GPIO -1, 0, 2
# define RA1_GPIO -1, 1, 3
# define RA2_GPIO -1, -1, 30
# define RA3_GPIO -1, -1, 29
# define RA4_GPIO -1, -1, 0
# define RB0_GPIO 0, 2, 4
# define RB1_GPIO 1, 3, 5
# define RB2_GPIO 2, 4, 6
# define RB3_GPIO 3, 5, 7
# define RB4_GPIO -1, -1, 1
# define RB5_GPIO -1, -1, 27
# define RB6_GPIO -1, -1, 24
# define RB7_GPIO -1, -1, 23
# define RB8_GPIO -1, -1, 22
# define RB9_GPIO -1, -1, 21
# define RB10_GPIO -1, -1, 16
# define RB11_GPIO -1, -1, 15
# define RB12_GPIO -1, -1, 14
# define RB13_GPIO 13, 11, 13
# define RB14_GPIO 14, 10, 12
# define RB15_GPIO 15, 9, 11
# define RC0_GPIO 16, 6, 8
# define RC1_GPIO 17, 7, 9
# define RC2_GPIO 18, 8, 10
# define RC3_GPIO -1, -1, 28
# define RC4_GPIO -1, -1, 25
# define RC5_GPIO -1, -1, 26
# define RC6_GPIO -1, -1, 18
# define RC7_GPIO -1, -1, 17
# define RC8_GPIO -1, -1, 20
# define RC9_GPIO -1, -1, 19
#elif defined(__PIC24HJ32GP204__)
# define RA0_GPIO -1, 0, 2
# define RA1_GPIO -1, 1, 3
# define RA2_GPIO -1, -1, 30
# define RA3_GPIO -1, -1, 29
# define RA4_GPIO -1, -1, 0
# define RB0_GPIO 0, 2, 4
# define RB1_GPIO 1, 3, 5
# define RB2_GPIO 2, 4, 6
# define RB3_GPIO 3, 5, 7
# define RB4_GPIO -1, -1, 1
# define RB5_GPIO -1, -1, 27
# define RB6_GPIO -1, -1, 24
# define RB7_GPIO -1, -1, 23
# define RB8_GPIO -1, -1, 22
# define RB9_GPIO -1, -1, 21
# define RB10_GPIO -1, -1, 16
# define RB11_GPIO -1, -1, 15
# define RB12_GPIO -1, -1, 14
# define RB13_GPIO 13, 11, 13
# define RB14_GPIO 14, 10, 12
# define RB15_GPIO 15, 9, 11
# define RC0_GPIO 16, 6, 8
# define RC1_GPIO 17, 7, 9
# define RC2_GPIO 18, 8, 10
# define RC3_GPIO -1, -1, 28
# define RC4_GPIO -1, -1, 25
# define RC5_GPIO -1, -1, 26
# define RC6_GPIO -1, -1, 18
# define RC7_GPIO -1, -1, 17
# define RC8_GPIO -1, -1, 20
# define RC9_GPIO -1, -1, 19
#elif defined(__PIC24HJ32GP304__)
# define RA0_GPIO -1, 0, 2
# define RA1_GPIO -1, 1, 3
# define RA2_GPIO -1, -1, 30
# define RA3_GPIO -1, -1, 29
# define RA4_GPIO -1, -1, 0
# define RB0_GPIO 0, 2, 4
# define RB1_GPIO 1, 3, 5
# define RB2_GPIO 2, 4, 6
# define RB3_GPIO 3, 5, 7
# define RB4_GPIO -1, -1, 1
# define RB5_GPIO -1, -1, 27
# define RB6_GPIO -1, -1, 24
# define RB7_GPIO -1, -1, 23
# define RB8_GPIO -1, -1, 22
# define RB9_GPIO -1, -1, 21
# define RB10_GPIO -1, -1, 16
# define RB11_GPIO -1, -1, 15
# define RB12_GPIO -1, -1, 14
# define RB13_GPIO 13, 11, 13
# define RB14_GPIO 14, 10, 12
# define RB15_GPIO 15, 9, 11
# define RC0_GPIO 16, 6, 8
# define RC1_GPIO 17, 7, 9
# define RC2_GPIO 18, 8, 10
# define RC3_GPIO -1, -1, 28
