bjones1/pic24lib_all/lib/include/pic24_ports_tables.h
# define RB15_GPIO -1, 15, 12
# define RC1_GPIO -1, 16, -1
# define RC2_GPIO -1, 17, -1
# define RC3_GPIO -1, 18, -1
# define RC4_GPIO -1, 19, -1
# define RC13_GPIO -1, -1, 1
# define RC14_GPIO -1, -1, 0
# define RD4_GPIO -1, -1, 13
# define RD5_GPIO -1, -1, 14
# define RD6_GPIO -1, -1, 15
# define RD7_GPIO -1, -1, 16
# define RD13_GPIO -1, -1, 19
# define RD14_GPIO -1, -1, 20
# define RD15_GPIO -1, -1, 21
# define RE0_GPIO -1, 24, -1
# define RE1_GPIO -1, 25, -1
# define RE2_GPIO -1, 26, -1
# define RE3_GPIO -1, 27, -1
# define RE4_GPIO -1, 28, -1
# define RE5_GPIO -1, 29, -1
# define RE6_GPIO -1, 30, -1
# define RE7_GPIO -1, 31, -1
# define RF4_GPIO -1, -1, 17
# define RF5_GPIO -1, -1, 18
# define RG6_GPIO -1, -1, 8
# define RG7_GPIO -1, -1, 9
# define RG8_GPIO -1, -1, 10
# define RG9_GPIO -1, -1, 11
#elif defined(__PIC24HJ128GP510__)
# define RA6_GPIO -1, 22, 22
# define RA7_GPIO -1, 23, 23
# define RA12_GPIO -1, 20, -1
# define RA13_GPIO -1, 21, -1
# define RB0_GPIO -1, 0, 2
# define RB1_GPIO -1, 1, 3
# define RB2_GPIO -1, 2, 4
# define RB3_GPIO -1, 3, 5
# define RB4_GPIO -1, 4, 6
# define RB5_GPIO -1, 5, 7
# define RB6_GPIO -1, 6, -1
# define RB7_GPIO -1, 7, -1
# define RB8_GPIO -1, 8, -1
# define RB9_GPIO -1, 9, -1
# define RB10_GPIO -1, 10, -1
# define RB11_GPIO -1, 11, -1
# define RB12_GPIO -1, 12, -1
# define RB13_GPIO -1, 13, -1
# define RB14_GPIO -1, 14, -1
# define RB15_GPIO -1, 15, 12
# define RC1_GPIO -1, 16, -1
# define RC2_GPIO -1, 17, -1
# define RC3_GPIO -1, 18, -1
# define RC4_GPIO -1, 19, -1
# define RC13_GPIO -1, -1, 1
# define RC14_GPIO -1, -1, 0
# define RD4_GPIO -1, -1, 13
# define RD5_GPIO -1, -1, 14
# define RD6_GPIO -1, -1, 15
# define RD7_GPIO -1, -1, 16
# define RD13_GPIO -1, -1, 19
# define RD14_GPIO -1, -1, 20
# define RD15_GPIO -1, -1, 21
# define RE0_GPIO -1, 24, -1
# define RE1_GPIO -1, 25, -1
# define RE2_GPIO -1, 26, -1
# define RE3_GPIO -1, 27, -1
# define RE4_GPIO -1, 28, -1
# define RE5_GPIO -1, 29, -1
# define RE6_GPIO -1, 30, -1
# define RE7_GPIO -1, 31, -1
# define RF4_GPIO -1, -1, 17
# define RF5_GPIO -1, -1, 18
# define RG6_GPIO -1, -1, 8
# define RG7_GPIO -1, -1, 9
# define RG8_GPIO -1, -1, 10
# define RG9_GPIO -1, -1, 11
#elif defined(__PIC24HJ64GP510a__)
# define RA6_GPIO -1, 22, 22
# define RA7_GPIO -1, 23, 23
# define RA12_GPIO -1, 20, -1
# define RA13_GPIO -1, 21, -1
# define RB0_GPIO -1, 0, 2
# define RB1_GPIO -1, 1, 3
# define RB2_GPIO -1, 2, 4
# define RB3_GPIO -1, 3, 5
# define RB4_GPIO -1, 4, 6
# define RB5_GPIO -1, 5, 7
# define RB6_GPIO -1, 6, -1
# define RB7_GPIO -1, 7, -1
# define RB8_GPIO -1, 8, -1
# define RB9_GPIO -1, 9, -1
# define RB10_GPIO -1, 10, -1
# define RB11_GPIO -1, 11, -1
# define RB12_GPIO -1, 12, -1
# define RB13_GPIO -1, 13, -1
# define RB14_GPIO -1, 14, -1
# define RB15_GPIO -1, 15, 12
# define RC1_GPIO -1, 16, -1
# define RC2_GPIO -1, 17, -1
# define RC3_GPIO -1, 18, -1
# define RC4_GPIO -1, 19, -1
# define RC13_GPIO -1, -1, 1
# define RC14_GPIO -1, -1, 0
# define RD4_GPIO -1, -1, 13
# define RD5_GPIO -1, -1, 14
# define RD6_GPIO -1, -1, 15
# define RD7_GPIO -1, -1, 16
# define RD13_GPIO -1, -1, 19
# define RD14_GPIO -1, -1, 20
# define RD15_GPIO -1, -1, 21
# define RE0_GPIO -1, 24, -1
# define RE1_GPIO -1, 25, -1
# define RE2_GPIO -1, 26, -1
# define RE3_GPIO -1, 27, -1
# define RE4_GPIO -1, 28, -1
# define RE5_GPIO -1, 29, -1
# define RE6_GPIO -1, 30, -1
# define RE7_GPIO -1, 31, -1
# define RF4_GPIO -1, -1, 17
# define RF5_GPIO -1, -1, 18
# define RG6_GPIO -1, -1, 8
# define RG7_GPIO -1, -1, 9
# define RG8_GPIO -1, -1, 10
# define RG9_GPIO -1, -1, 11
#elif defined(__PIC24HJ128GP510a__)
# define RA6_GPIO -1, 22, 22
# define RA7_GPIO -1, 23, 23
# define RA12_GPIO -1, 20, -1
# define RA13_GPIO -1, 21, -1
# define RB0_GPIO -1, 0, 2
# define RB1_GPIO -1, 1, 3
# define RB2_GPIO -1, 2, 4
# define RB3_GPIO -1, 3, 5
# define RB4_GPIO -1, 4, 6
# define RB5_GPIO -1, 5, 7
# define RB6_GPIO -1, 6, -1
# define RB7_GPIO -1, 7, -1
# define RB8_GPIO -1, 8, -1
# define RB9_GPIO -1, 9, -1
# define RB10_GPIO -1, 10, -1
# define RB11_GPIO -1, 11, -1
# define RB12_GPIO -1, 12, -1
# define RB13_GPIO -1, 13, -1
# define RB14_GPIO -1, 14, -1
# define RB15_GPIO -1, 15, 12
# define RC1_GPIO -1, 16, -1
# define RC2_GPIO -1, 17, -1
# define RC3_GPIO -1, 18, -1
# define RC4_GPIO -1, 19, -1
# define RC13_GPIO -1, -1, 1
# define RC14_GPIO -1, -1, 0
# define RD4_GPIO -1, -1, 13
# define RD5_GPIO -1, -1, 14
# define RD6_GPIO -1, -1, 15
# define RD7_GPIO -1, -1, 16
# define RD13_GPIO -1, -1, 19
# define RD14_GPIO -1, -1, 20
# define RD15_GPIO -1, -1, 21
# define RE0_GPIO -1, 24, -1
# define RE1_GPIO -1, 25, -1
# define RE2_GPIO -1, 26, -1
# define RE3_GPIO -1, 27, -1
# define RE4_GPIO -1, 28, -1
# define RE5_GPIO -1, 29, -1
# define RE6_GPIO -1, 30, -1
# define RE7_GPIO -1, 31, -1
# define RF4_GPIO -1, -1, 17
# define RF5_GPIO -1, -1, 18
# define RG6_GPIO -1, -1, 8
# define RG7_GPIO -1, -1, 9
# define RG8_GPIO -1, -1, 10
# define RG9_GPIO -1, -1, 11
#elif defined(__PIC24HJ256GP610__)
# define RA6_GPIO -1, 22, 22
# define RA7_GPIO -1, 23, 23
# define RA12_GPIO -1, 20, -1
# define RA13_GPIO -1, 21, -1
# define RB0_GPIO -1, 0, 2
# define RB1_GPIO -1, 1, 3
# define RB2_GPIO -1, 2, 4
# define RB3_GPIO -1, 3, 5
# define RB4_GPIO -1, 4, 6
# define RB5_GPIO -1, 5, 7
# define RB6_GPIO -1, 6, -1
# define RB7_GPIO -1, 7, -1
# define RB8_GPIO -1, 8, -1
# define RB9_GPIO -1, 9, -1
# define RB10_GPIO -1, 10, -1
# define RB11_GPIO -1, 11, -1
# define RB12_GPIO -1, 12, -1
# define RB13_GPIO -1, 13, -1
# define RB14_GPIO -1, 14, -1
# define RB15_GPIO -1, 15, 12
# define RC1_GPIO -1, 16, -1
# define RC2_GPIO -1, 17, -1
# define RC3_GPIO -1, 18, -1
# define RC4_GPIO -1, 19, -1
# define RC13_GPIO -1, -1, 1
# define RC14_GPIO -1, -1, 0
# define RD4_GPIO -1, -1, 13
# define RD5_GPIO -1, -1, 14
# define RD6_GPIO -1, -1, 15
# define RD7_GPIO -1, -1, 16
# define RD13_GPIO -1, -1, 19
# define RD14_GPIO -1, -1, 20
# define RD15_GPIO -1, -1, 21
# define RE0_GPIO -1, 24, -1
# define RE1_GPIO -1, 25, -1
# define RE2_GPIO -1, 26, -1
# define RE3_GPIO -1, 27, -1
# define RE4_GPIO -1, 28, -1
# define RE5_GPIO -1, 29, -1
# define RE6_GPIO -1, 30, -1
# define RE7_GPIO -1, 31, -1
# define RF4_GPIO -1, -1, 17
# define RF5_GPIO -1, -1, 18
# define RG6_GPIO -1, -1, 8
# define RG7_GPIO -1, -1, 9
# define RG8_GPIO -1, -1, 10
# define RG9_GPIO -1, -1, 11
#elif defined(__PIC24FJ16ga002__)
# define RA0_GPIO -1, 0, 2
# define RA1_GPIO -1, 1, 3
# define RA2_GPIO -1, -1, 30
# define RA3_GPIO -1, -1, 29
# define RA4_GPIO -1, -1, 0
# define RB0_GPIO 0, 2, 4
# define RB1_GPIO 1, 3, 5
# define RB2_GPIO 2, 4, 6
# define RB3_GPIO 3, 5, 7
# define RB4_GPIO -1, -1, 1
# define RB5_GPIO -1, -1, 27
# define RB6_GPIO -1, -1, 24
# define RB7_GPIO -1, -1, 23
# define RB8_GPIO -1, -1, 22
# define RB9_GPIO -1, -1, 21
# define RB10_GPIO -1, -1, 16
# define RB11_GPIO -1, -1, 15
# define RB12_GPIO 12, 12, 14
# define RB13_GPIO 13, 11, 13
# define RB14_GPIO 14, 10, 12
# define RB15_GPIO 15, 9, 11
#elif defined(__PIC24FJ32ga002__)
# define RA0_GPIO -1, 0, 2
# define RA1_GPIO -1, 1, 3
# define RA2_GPIO -1, -1, 30
# define RA3_GPIO -1, -1, 29
# define RA4_GPIO -1, -1, 0
# define RB0_GPIO 0, 2, 4
# define RB1_GPIO 1, 3, 5
# define RB2_GPIO 2, 4, 6
# define RB3_GPIO 3, 5, 7
# define RB4_GPIO -1, -1, 1
# define RB5_GPIO -1, -1, 27
# define RB6_GPIO -1, -1, 24
# define RB7_GPIO -1, -1, 23
# define RB8_GPIO -1, -1, 22
# define RB9_GPIO -1, -1, 21
# define RB10_GPIO -1, -1, 16
# define RB11_GPIO -1, -1, 15
# define RB12_GPIO 12, 12, 14
# define RB13_GPIO 13, 11, 13
# define RB14_GPIO 14, 10, 12
# define RB15_GPIO 15, 9, 11
#elif defined(__PIC24FJ48ga002__)
# define RA0_GPIO -1, 0, 2
# define RA1_GPIO -1, 1, 3
# define RA2_GPIO -1, -1, 30
# define RA3_GPIO -1, -1, 29
# define RA4_GPIO -1, -1, 0
# define RB0_GPIO 0, 2, 4
# define RB1_GPIO 1, 3, 5
# define RB2_GPIO 2, 4, 6
# define RB3_GPIO 3, 5, 7
# define RB4_GPIO -1, -1, 1
# define RB5_GPIO -1, -1, 27
# define RB6_GPIO -1, -1, 24
# define RB7_GPIO -1, -1, 23
# define RB8_GPIO -1, -1, 22
# define RB9_GPIO -1, -1, 21
# define RB10_GPIO -1, -1, 16
# define RB11_GPIO -1, -1, 15
# define RB12_GPIO 12, 12, 14
# define RB13_GPIO 13, 11, 13
# define RB14_GPIO 14, 10, 12
# define RB15_GPIO 15, 9, 11
#elif defined(__PIC24FJ64ga002__)
# define RA0_GPIO -1, 0, 2
# define RA1_GPIO -1, 1, 3
# define RA2_GPIO -1, -1, 30
# define RA3_GPIO -1, -1, 29
# define RA4_GPIO -1, -1, 0
# define RB0_GPIO 0, 2, 4
# define RB1_GPIO 1, 3, 5
# define RB2_GPIO 2, 4, 6
# define RB3_GPIO 3, 5, 7
# define RB4_GPIO -1, -1, 1
# define RB5_GPIO -1, -1, 27
# define RB6_GPIO -1, -1, 24
# define RB7_GPIO -1, -1, 23
# define RB8_GPIO -1, -1, 22
# define RB9_GPIO -1, -1, 21
# define RB10_GPIO -1, -1, 16
# define RB11_GPIO -1, -1, 15
# define RB12_GPIO 12, 12, 14
# define RB13_GPIO 13, 11, 13
# define RB14_GPIO 14, 10, 12
# define RB15_GPIO 15, 9, 11
#elif defined(__PIC24FJ32ga102__)
# define RA0_GPIO -1, 0, 2
# define RA1_GPIO -1, 1, 3
# define RA2_GPIO -1, -1, 30
# define RA3_GPIO -1, -1, 29
# define RA4_GPIO -1, -1, 0
# define RB0_GPIO 0, 2, 4
# define RB1_GPIO 1, 3, 5
# define RB2_GPIO 2, 4, 6
# define RB3_GPIO 3, 5, 7
# define RB4_GPIO -1, -1, 1
# define RB5_GPIO -1, -1, 27
# define RB6_GPIO -1, -1, 24
# define RB7_GPIO -1, -1, 23
# define RB8_GPIO -1, -1, 22
# define RB9_GPIO -1, -1, 21
# define RB10_GPIO -1, -1, 16
# define RB11_GPIO -1, -1, 15
# define RB12_GPIO 12, 12, 14
# define RB13_GPIO 13, 11, 13
# define RB14_GPIO 14, 10, 12
# define RB15_GPIO 15, 9, 11
#elif defined(__PIC24FJ64ga102__)
# define RA0_GPIO -1, 0, 2
# define RA1_GPIO -1, 1, 3
# define RA2_GPIO -1, -1, 30
# define RA3_GPIO -1, -1, 29
# define RA4_GPIO -1, -1, 0
# define RB0_GPIO 0, 2, 4
# define RB1_GPIO 1, 3, 5
# define RB2_GPIO 2, 4, 6
# define RB3_GPIO 3, 5, 7
# define RB4_GPIO -1, -1, 1
# define RB5_GPIO -1, -1, 27
# define RB6_GPIO -1, -1, 24
# define RB7_GPIO -1, -1, 23
# define RB8_GPIO -1, -1, 22
# define RB9_GPIO -1, -1, 21
# define RB10_GPIO -1, -1, 16
# define RB11_GPIO -1, -1, 15
# define RB12_GPIO 12, 12, 14
# define RB13_GPIO 13, 11, 13
# define RB14_GPIO 14, 10, 12
# define RB15_GPIO 15, 9, 11
#elif defined(__PIC24FJ32gb002__)
# define RA0_GPIO 5, 0, 2
# define RA1_GPIO 6, 1, 3
# define RA2_GPIO -1, -1, 30
# define RA3_GPIO -1, -1, 29
# define RA4_GPIO -1, -1, 0
# define RB0_GPIO 0, 2, 4
# define RB1_GPIO 1, 3, 5
# define RB2_GPIO 2, 4, 6
# define RB3_GPIO 3, 5, 7
# define RB4_GPIO -1, -1, 1
# define RB5_GPIO -1, -1, 27
# define RB7_GPIO -1, -1, 23
# define RB8_GPIO -1, -1, 22
# define RB9_GPIO -1, -1, 21
# define RB10_GPIO -1, -1, 16
# define RB11_GPIO -1, -1, 15
# define RB13_GPIO 13, 11, 13
# define RB14_GPIO 14, 10, 12
# define RB15_GPIO 15, 9, 11
#elif defined(__PIC24FJ64gb002__)
# define RA0_GPIO 5, 0, 2
# define RA1_GPIO 6, 1, 3
# define RA2_GPIO -1, -1, 30
# define RA3_GPIO -1, -1, 29
# define RA4_GPIO -1, -1, 0
# define RB0_GPIO 0, 2, 4
# define RB1_GPIO 1, 3, 5
# define RB2_GPIO 2, 4, 6
# define RB3_GPIO 3, 5, 7
# define RB4_GPIO -1, -1, 1
# define RB5_GPIO -1, -1, 27
# define RB7_GPIO -1, -1, 23
# define RB8_GPIO -1, -1, 22
# define RB9_GPIO -1, -1, 21
# define RB10_GPIO -1, -1, 16
# define RB11_GPIO -1, -1, 15
# define RB13_GPIO 13, 11, 13
# define RB14_GPIO 14, 10, 12
# define RB15_GPIO 15, 9, 11
#elif defined(__PIC24FJ16ga004__)
# define RA0_GPIO -1, 0, 2
# define RA1_GPIO -1, 1, 3
# define RA2_GPIO -1, -1, 30
# define RA3_GPIO -1, -1, 29
# define RA4_GPIO -1, -1, 0
# define RB0_GPIO 0, 2, 4
# define RB1_GPIO 1, 3, 5
# define RB2_GPIO 2, 4, 6
# define RB3_GPIO 3, 5, 7
# define RB4_GPIO -1, -1, 1
# define RB5_GPIO -1, -1, 27
# define RB6_GPIO -1, -1, 24
# define RB7_GPIO -1, -1, 23
# define RB8_GPIO -1, -1, 22
# define RB9_GPIO -1, -1, 21
# define RB10_GPIO -1, -1, 16
# define RB11_GPIO -1, -1, 15
# define RB12_GPIO -1, -1, 14
# define RB13_GPIO 13, 11, 13
# define RB14_GPIO 14, 10, 12
# define RB15_GPIO 15, 9, 11
# define RC0_GPIO 16, 6, 8
# define RC1_GPIO 17, 7, 9
# define RC2_GPIO 18, 8, 10
# define RC3_GPIO -1, -1, 28
# define RC4_GPIO -1, -1, 25
# define RC5_GPIO -1, -1, 26
# define RC6_GPIO -1, -1, 18
# define RC7_GPIO -1, -1, 17
# define RC8_GPIO -1, -1, 20
# define RC9_GPIO -1, -1, 19
#elif defined(__PIC24FJ32ga004__)
# define RA0_GPIO -1, 0, 2
# define RA1_GPIO -1, 1, 3
# define RA2_GPIO -1, -1, 30
# define RA3_GPIO -1, -1, 29
# define RA4_GPIO -1, -1, 0
# define RB0_GPIO 0, 2, 4
# define RB1_GPIO 1, 3, 5
# define RB2_GPIO 2, 4, 6
# define RB3_GPIO 3, 5, 7
# define RB4_GPIO -1, -1, 1
# define RB5_GPIO -1, -1, 27
# define RB6_GPIO -1, -1, 24
# define RB7_GPIO -1, -1, 23
# define RB8_GPIO -1, -1, 22
# define RB9_GPIO -1, -1, 21
# define RB10_GPIO -1, -1, 16
# define RB11_GPIO -1, -1, 15
# define RB12_GPIO -1, -1, 14
# define RB13_GPIO 13, 11, 13
# define RB14_GPIO 14, 10, 12
# define RB15_GPIO 15, 9, 11
# define RC0_GPIO 16, 6, 8
# define RC1_GPIO 17, 7, 9
# define RC2_GPIO 18, 8, 10
# define RC3_GPIO -1, -1, 28
# define RC4_GPIO -1, -1, 25
# define RC5_GPIO -1, -1, 26
# define RC6_GPIO -1, -1, 18
# define RC7_GPIO -1, -1, 17
# define RC8_GPIO -1, -1, 20
# define RC9_GPIO -1, -1, 19
#elif defined(__PIC24FJ48ga004__)
# define RA0_GPIO -1, 0, 2
# define RA1_GPIO -1, 1, 3
# define RA2_GPIO -1, -1, 30
# define RA3_GPIO -1, -1, 29
# define RA4_GPIO -1, -1, 0
# define RB0_GPIO 0, 2, 4
# define RB1_GPIO 1, 3, 5
# define RB2_GPIO 2, 4, 6
# define RB3_GPIO 3, 5, 7
# define RB4_GPIO -1, -1, 1
# define RB5_GPIO -1, -1, 27
# define RB6_GPIO -1, -1, 24
# define RB7_GPIO -1, -1, 23
# define RB8_GPIO -1, -1, 22
# define RB9_GPIO -1, -1, 21
# define RB10_GPIO -1, -1, 16
# define RB11_GPIO -1, -1, 15
# define RB12_GPIO -1, -1, 14
# define RB13_GPIO 13, 11, 13
# define RB14_GPIO 14, 10, 12
# define RB15_GPIO 15, 9, 11
# define RC0_GPIO 16, 6, 8
# define RC1_GPIO 17, 7, 9
# define RC2_GPIO 18, 8, 10
# define RC3_GPIO -1, -1, 28
# define RC4_GPIO -1, -1, 25
# define RC5_GPIO -1, -1, 26
# define RC6_GPIO -1, -1, 18
# define RC7_GPIO -1, -1, 17
# define RC8_GPIO -1, -1, 20
# define RC9_GPIO -1, -1, 19
#elif defined(__PIC24FJ64ga004__)
# define RA0_GPIO -1, 0, 2
# define RA1_GPIO -1, 1, 3
# define RA2_GPIO -1, -1, 30
# define RA3_GPIO -1, -1, 29
# define RA4_GPIO -1, -1, 0
# define RB0_GPIO 0, 2, 4
# define RB1_GPIO 1, 3, 5
# define RB2_GPIO 2, 4, 6
# define RB3_GPIO 3, 5, 7
# define RB4_GPIO -1, -1, 1
# define RB5_GPIO -1, -1, 27
# define RB6_GPIO -1, -1, 24
# define RB7_GPIO -1, -1, 23
# define RB8_GPIO -1, -1, 22
# define RB9_GPIO -1, -1, 21
# define RB10_GPIO -1, -1, 16
# define RB11_GPIO -1, -1, 15
# define RB12_GPIO -1, -1, 14
# define RB13_GPIO 13, 11, 13
# define RB14_GPIO 14, 10, 12
# define RB15_GPIO 15, 9, 11
# define RC0_GPIO 16, 6, 8
# define RC1_GPIO 17, 7, 9
# define RC2_GPIO 18, 8, 10
# define RC3_GPIO -1, -1, 28
# define RC4_GPIO -1, -1, 25
# define RC5_GPIO -1, -1, 26
# define RC6_GPIO -1, -1, 18
# define RC7_GPIO -1, -1, 17
# define RC8_GPIO -1, -1, 20
# define RC9_GPIO -1, -1, 19
#elif defined(__PIC24FJ32ga104__)
# define RA0_GPIO -1, 0, 2
# define RA1_GPIO -1, 1, 3
# define RA2_GPIO -1, -1, 30
# define RA3_GPIO -1, -1, 29
# define RA4_GPIO -1, -1, 0
# define RB0_GPIO 0, 2, 4
# define RB1_GPIO 1, 3, 5
# define RB2_GPIO 2, 4, 6
# define RB3_GPIO 3, 5, 7
# define RB4_GPIO -1, -1, 1
# define RB5_GPIO -1, -1, 27
# define RB6_GPIO -1, -1, 24
# define RB7_GPIO -1, -1, 23
# define RB8_GPIO -1, -1, 22
# define RB9_GPIO -1, -1, 21
# define RB10_GPIO -1, -1, 16
# define RB11_GPIO -1, -1, 15
# define RB12_GPIO -1, -1, 14
# define RB13_GPIO 13, 11, 13
# define RB14_GPIO 14, 10, 12
# define RB15_GPIO 15, 9, 11
# define RC0_GPIO 16, 6, 8
# define RC1_GPIO 17, 7, 9
# define RC2_GPIO 18, 8, 10
# define RC3_GPIO -1, -1, 28
# define RC4_GPIO -1, -1, 25
# define RC5_GPIO -1, -1, 26
# define RC6_GPIO -1, -1, 18
# define RC7_GPIO -1, -1, 17
# define RC8_GPIO -1, -1, 20
# define RC9_GPIO -1, -1, 19
#elif defined(__PIC24FJ64ga104__)
# define RA0_GPIO -1, 0, 2
# define RA1_GPIO -1, 1, 3
# define RA2_GPIO -1, -1, 30
# define RA3_GPIO -1, -1, 29
# define RA4_GPIO -1, -1, 0
# define RB0_GPIO 0, 2, 4
# define RB1_GPIO 1, 3, 5
# define RB2_GPIO 2, 4, 6
# define RB3_GPIO 3, 5, 7
# define RB4_GPIO -1, -1, 1
# define RB5_GPIO -1, -1, 27
# define RB6_GPIO -1, -1, 24
# define RB7_GPIO -1, -1, 23
# define RB8_GPIO -1, -1, 22
# define RB9_GPIO -1, -1, 21
# define RB10_GPIO -1, -1, 16
# define RB11_GPIO -1, -1, 15
# define RB12_GPIO -1, -1, 14
# define RB13_GPIO 13, 11, 13
# define RB14_GPIO 14, 10, 12
# define RB15_GPIO 15, 9, 11
# define RC0_GPIO 16, 6, 8
# define RC1_GPIO 17, 7, 9
# define RC2_GPIO 18, 8, 10
# define RC3_GPIO -1, -1, 28
# define RC4_GPIO -1, -1, 25
# define RC5_GPIO -1, -1, 26
# define RC6_GPIO -1, -1, 18
# define RC7_GPIO -1, -1, 17
# define RC8_GPIO -1, -1, 20
# define RC9_GPIO -1, -1, 19
#elif defined(__PIC24FJ32gb004__)
# define RA0_GPIO -1, -1, 2
# define RA1_GPIO -1, -1, 3
# define RA2_GPIO -1, -1, 30
# define RA3_GPIO -1, -1, 29
# define RA4_GPIO -1, -1, 0
# define RB0_GPIO -1, -1, 4
# define RB1_GPIO -1, -1, 5
# define RB2_GPIO -1, -1, 6
# define RB3_GPIO -1, -1, 7
# define RB4_GPIO -1, -1, 1
# define RB5_GPIO -1, -1, 27
# define RB7_GPIO -1, -1, 23
# define RB8_GPIO -1, -1, 18
# define RB9_GPIO -1, -1, 22
# define RB10_GPIO -1, -1, 16
# define RB11_GPIO -1, -1, 15
# define RB13_GPIO -1, -1, 13
# define RB14_GPIO -1, -1, 12
# define RB15_GPIO -1, -1, 11
# define RC0_GPIO -1, -1, 8
# define RC1_GPIO -1, -1, 9
# define RC2_GPIO -1, -1, 10
# define RC3_GPIO -1, -1, 28
# define RC4_GPIO -1, -1, 25
# define RC5_GPIO -1, -1, 26
# define RC6_GPIO -1, -1, 18
# define RC7_GPIO -1, -1, 17
# define RC8_GPIO -1, -1, 20
# define RC9_GPIO -1, -1, 19
#elif defined(__PIC24FJ64gb004__)
# define RA0_GPIO -1, -1, 2
# define RA1_GPIO -1, -1, 3
# define RA2_GPIO -1, -1, 30
# define RA3_GPIO -1, -1, 29
# define RA4_GPIO -1, -1, 0
# define RB0_GPIO -1, -1, 4
# define RB1_GPIO -1, -1, 5
# define RB2_GPIO -1, -1, 6
# define RB3_GPIO -1, -1, 7
# define RB4_GPIO -1, -1, 1
# define RB5_GPIO -1, -1, 27
# define RB7_GPIO -1, -1, 23
# define RB8_GPIO -1, -1, 18
# define RB9_GPIO -1, -1, 22
# define RB10_GPIO -1, -1, 16
# define RB11_GPIO -1, -1, 15
# define RB13_GPIO -1, -1, 13
# define RB14_GPIO -1, -1, 12
# define RB15_GPIO -1, -1, 11
# define RC0_GPIO -1, -1, 8
# define RC1_GPIO -1, -1, 9
# define RC2_GPIO -1, -1, 10
# define RC3_GPIO -1, -1, 28
# define RC4_GPIO -1, -1, 25
# define RC5_GPIO -1, -1, 26
# define RC6_GPIO -1, -1, 18
# define RC7_GPIO -1, -1, 17
# define RC8_GPIO -1, -1, 20
# define RC9_GPIO -1, -1, 19
#elif defined(__PIC24FJ128ga106__)
# define RB0_GPIO 0, 0, 2
# define RB1_GPIO 1, 1, 3
# define RB2_GPIO 13, 2, 4
# define RB3_GPIO -1, 3, 5
# define RB4_GPIO 28, 4, 6
# define RB5_GPIO 18, 5, 7
# define RB6_GPIO 6, 6, 24
# define RB7_GPIO 7, 7, 25
# define RB8_GPIO 8, 8, 26
# define RB9_GPIO 9, 9, 27
# define RB10_GPIO -1, 10, 28
# define RB11_GPIO -1, 11, 29
# define RB12_GPIO -1, 12, 30
# define RB13_GPIO -1, 13, 31
# define RB14_GPIO 14, 14, 32
# define RB15_GPIO 29, 15, 12
# define RC12_GPIO -1, -1, 23
# define RC13_GPIO -1, -1, 1
# define RC14_GPIO -1, -1, 0
# define RC15_GPIO -1, -1, 22
# define RD0_GPIO -1, -1, 49
# define RD1_GPIO -1, -1, 50
# define RD2_GPIO -1, -1, 51
# define RD3_GPIO -1, -1, 52
# define RD4_GPIO -1, -1, 13
# define RD5_GPIO -1, -1, 14
# define RD6_GPIO -1, -1, 15
# define RD7_GPIO -1, -1, 16
# define RD8_GPIO -1, -1, 53
# define RD9_GPIO -1, -1, 54
# define RD10_GPIO -1, -1, 55
# define RD11_GPIO -1, -1, 56
# define RE0_GPIO -1, -1, 58
# define RE1_GPIO -1, -1, 59
# define RE2_GPIO -1, -1, 60
# define RE3_GPIO -1, -1, 61
# define RE4_GPIO -1, -1, 62
# define RE5_GPIO -1, -1, 63
# define RE6_GPIO -1, -1, 64
# define RE7_GPIO -1, -1, 65
# define RF0_GPIO -1, -1, 68
# define RF1_GPIO -1, -1, 69
# define RF2_GPIO -1, -1, 70
# define RF3_GPIO -1, -1, 71
# define RF4_GPIO -1, -1, 17
# define RF5_GPIO -1, -1, 18
# define RF6_GPIO -1, -1, 72
# define RG2_GPIO -1, -1, 83
# define RG3_GPIO -1, -1, 84
# define RG6_GPIO -1, -1, 8
# define RG7_GPIO -1, -1, 9
# define RG8_GPIO -1, -1, 10
# define RG9_GPIO -1, -1, 11
#elif defined(__PIC24FJ192ga106__)
# define RB0_GPIO 0, 0, 2
# define RB1_GPIO 1, 1, 3
# define RB2_GPIO 13, 2, 4
# define RB3_GPIO -1, 3, 5
# define RB4_GPIO 28, 4, 6
# define RB5_GPIO 18, 5, 7
# define RB6_GPIO 6, 6, 24
# define RB7_GPIO 7, 7, 25
# define RB8_GPIO 8, 8, 26
# define RB9_GPIO 9, 9, 27
# define RB10_GPIO -1, 10, 28
# define RB11_GPIO -1, 11, 29
# define RB12_GPIO -1, 12, 30
# define RB13_GPIO -1, 13, 31
# define RB14_GPIO 14, 14, 32
# define RB15_GPIO 29, 15, 12
# define RC12_GPIO -1, -1, 23
# define RC13_GPIO -1, -1, 1
# define RC14_GPIO -1, -1, 0
# define RC15_GPIO -1, -1, 22
# define RD0_GPIO -1, -1, 49
# define RD1_GPIO -1, -1, 50
# define RD2_GPIO -1, -1, 51
# define RD3_GPIO -1, -1, 52
# define RD4_GPIO -1, -1, 13
# define RD5_GPIO -1, -1, 14
# define RD6_GPIO -1, -1, 15
# define RD7_GPIO -1, -1, 16
# define RD8_GPIO -1, -1, 53
# define RD9_GPIO -1, -1, 54
# define RD10_GPIO -1, -1, 55
# define RD11_GPIO -1, -1, 56
# define RE0_GPIO -1, -1, 58
# define RE1_GPIO -1, -1, 59
# define RE2_GPIO -1, -1, 60
# define RE3_GPIO -1, -1, 61
# define RE4_GPIO -1, -1, 62
# define RE5_GPIO -1, -1, 63
# define RE6_GPIO -1, -1, 64
# define RE7_GPIO -1, -1, 65
# define RF0_GPIO -1, -1, 68
# define RF1_GPIO -1, -1, 69
# define RF2_GPIO -1, -1, 70
# define RF3_GPIO -1, -1, 71
# define RF4_GPIO -1, -1, 17
# define RF5_GPIO -1, -1, 18
# define RF6_GPIO -1, -1, 72
# define RG2_GPIO -1, -1, 83
# define RG3_GPIO -1, -1, 84
# define RG6_GPIO -1, -1, 8
# define RG7_GPIO -1, -1, 9
# define RG8_GPIO -1, -1, 10
# define RG9_GPIO -1, -1, 11
#elif defined(__PIC24FJ256ga106__)
# define RB0_GPIO 0, 0, 2
# define RB1_GPIO 1, 1, 3
# define RB2_GPIO 13, 2, 4
# define RB3_GPIO -1, 3, 5
# define RB4_GPIO 28, 4, 6
# define RB5_GPIO 18, 5, 7
# define RB6_GPIO 6, 6, 24
# define RB7_GPIO 7, 7, 25
# define RB8_GPIO 8, 8, 26
# define RB9_GPIO 9, 9, 27
# define RB10_GPIO -1, 10, 28
# define RB11_GPIO -1, 11, 29
# define RB12_GPIO -1, 12, 30
# define RB13_GPIO -1, 13, 31
# define RB14_GPIO 14, 14, 32
# define RB15_GPIO 29, 15, 12
# define RC12_GPIO -1, -1, 23
# define RC13_GPIO -1, -1, 1
# define RC14_GPIO -1, -1, 0
# define RC15_GPIO -1, -1, 22
# define RD0_GPIO -1, -1, 49
# define RD1_GPIO -1, -1, 50
# define RD2_GPIO -1, -1, 51
# define RD3_GPIO -1, -1, 52
# define RD4_GPIO -1, -1, 13
# define RD5_GPIO -1, -1, 14
# define RD6_GPIO -1, -1, 15
# define RD7_GPIO -1, -1, 16
# define RD8_GPIO -1, -1, 53
# define RD9_GPIO -1, -1, 54
# define RD10_GPIO -1, -1, 55
# define RD11_GPIO -1, -1, 56
# define RE0_GPIO -1, -1, 58
# define RE1_GPIO -1, -1, 59
# define RE2_GPIO -1, -1, 60
# define RE3_GPIO -1, -1, 61
# define RE4_GPIO -1, -1, 62
# define RE5_GPIO -1, -1, 63
# define RE6_GPIO -1, -1, 64
# define RE7_GPIO -1, -1, 65
# define RF0_GPIO -1, -1, 68
# define RF1_GPIO -1, -1, 69
# define RF2_GPIO -1, -1, 70
# define RF3_GPIO -1, -1, 71
# define RF4_GPIO -1, -1, 17
# define RF5_GPIO -1, -1, 18
# define RF6_GPIO -1, -1, 72
# define RG2_GPIO -1, -1, 83
# define RG3_GPIO -1, -1, 84
# define RG6_GPIO -1, -1, 8
# define RG7_GPIO -1, -1, 9
# define RG8_GPIO -1, -1, 10
# define RG9_GPIO -1, -1, 11
#elif defined(__PIC24FJ64ga006__)
# define RB0_GPIO -1, 0, 2
# define RB1_GPIO -1, 1, 3
# define RB2_GPIO -1, 2, 4
# define RB3_GPIO -1, 3, 5
# define RB4_GPIO -1, 4, 6
# define RB5_GPIO -1, 5, 7
# define RB6_GPIO -1, 6, -1
# define RB7_GPIO -1, 7, -1
# define RB8_GPIO -1, 8, -1
# define RB9_GPIO -1, 9, -1
# define RB10_GPIO -1, 10, -1
# define RB11_GPIO -1, 11, -1
# define RB12_GPIO -1, 12, -1
# define RB13_GPIO -1, 13, -1
# define RB14_GPIO -1, 14, -1
# define RB15_GPIO -1, 15, 12
# define RC13_GPIO -1, -1, 1
# define RC14_GPIO -1, -1, 0
# define RD4_GPIO -1, -1, 13
# define RD5_GPIO -1, -1, 14
# define RD6_GPIO -1, -1, 15
# define RD7_GPIO -1, -1, 16
# define RF4_GPIO -1, -1, 17
# define RF5_GPIO -1, -1, 18
# define RG6_GPIO -1, -1, 8
# define RG7_GPIO -1, -1, 9
