bjones1/pic24lib_all/lib/include/pic24_ports_tables.h
# define RG8_GPIO -1, -1, 10
# define RG9_GPIO -1, -1, 11
#elif defined(__PIC24FJ96ga006__)
# define RB0_GPIO -1, 0, 2
# define RB1_GPIO -1, 1, 3
# define RB2_GPIO -1, 2, 4
# define RB3_GPIO -1, 3, 5
# define RB4_GPIO -1, 4, 6
# define RB5_GPIO -1, 5, 7
# define RB6_GPIO -1, 6, -1
# define RB7_GPIO -1, 7, -1
# define RB8_GPIO -1, 8, -1
# define RB9_GPIO -1, 9, -1
# define RB10_GPIO -1, 10, -1
# define RB11_GPIO -1, 11, -1
# define RB12_GPIO -1, 12, -1
# define RB13_GPIO -1, 13, -1
# define RB14_GPIO -1, 14, -1
# define RB15_GPIO -1, 15, 12
# define RC13_GPIO -1, -1, 1
# define RC14_GPIO -1, -1, 0
# define RD4_GPIO -1, -1, 13
# define RD5_GPIO -1, -1, 14
# define RD6_GPIO -1, -1, 15
# define RD7_GPIO -1, -1, 16
# define RF4_GPIO -1, -1, 17
# define RF5_GPIO -1, -1, 18
# define RG6_GPIO -1, -1, 8
# define RG7_GPIO -1, -1, 9
# define RG8_GPIO -1, -1, 10
# define RG9_GPIO -1, -1, 11
#elif defined(__PIC24FJ128ga006__)
# define RB0_GPIO -1, 0, 2
# define RB1_GPIO -1, 1, 3
# define RB2_GPIO -1, 2, 4
# define RB3_GPIO -1, 3, 5
# define RB4_GPIO -1, 4, 6
# define RB5_GPIO -1, 5, 7
# define RB6_GPIO -1, 6, -1
# define RB7_GPIO -1, 7, -1
# define RB8_GPIO -1, 8, -1
# define RB9_GPIO -1, 9, -1
# define RB10_GPIO -1, 10, -1
# define RB11_GPIO -1, 11, -1
# define RB12_GPIO -1, 12, -1
# define RB13_GPIO -1, 13, -1
# define RB14_GPIO -1, 14, -1
# define RB15_GPIO -1, 15, 12
# define RC13_GPIO -1, -1, 1
# define RC14_GPIO -1, -1, 0
# define RD4_GPIO -1, -1, 13
# define RD5_GPIO -1, -1, 14
# define RD6_GPIO -1, -1, 15
# define RD7_GPIO -1, -1, 16
# define RF4_GPIO -1, -1, 17
# define RF5_GPIO -1, -1, 18
# define RG6_GPIO -1, -1, 8
# define RG7_GPIO -1, -1, 9
# define RG8_GPIO -1, -1, 10
# define RG9_GPIO -1, -1, 11
#elif defined(__PIC24FJ64gb106__)
# define RB0_GPIO 0, 0, 2
# define RB1_GPIO 1, 1, 3
# define RB2_GPIO 13, 2, 4
# define RB3_GPIO -1, 3, 5
# define RB4_GPIO 28, 4, 6
# define RB5_GPIO 18, 5, 7
# define RB6_GPIO 6, 6, 24
# define RB7_GPIO 7, 7, 25
# define RB8_GPIO 8, 8, 26
# define RB9_GPIO 9, 9, 27
# define RB10_GPIO -1, 10, 28
# define RB11_GPIO -1, 11, 29
# define RB12_GPIO -1, 12, 30
# define RB13_GPIO -1, 13, 31
# define RB14_GPIO 14, 14, 32
# define RB15_GPIO 29, 15, 12
# define RC12_GPIO -1, -1, 23
# define RC13_GPIO -1, -1, 1
# define RC14_GPIO -1, -1, 0
# define RC15_GPIO -1, -1, 22
# define RD0_GPIO -1, -1, 49
# define RD1_GPIO -1, -1, 50
# define RD2_GPIO -1, -1, 51
# define RD3_GPIO -1, -1, 52
# define RD4_GPIO -1, -1, 13
# define RD5_GPIO -1, -1, 14
# define RD6_GPIO -1, -1, 15
# define RD7_GPIO -1, -1, 16
# define RD8_GPIO -1, -1, 53
# define RD9_GPIO -1, -1, 54
# define RD10_GPIO -1, -1, 55
# define RD11_GPIO -1, -1, 56
# define RE0_GPIO -1, -1, 58
# define RE1_GPIO -1, -1, 59
# define RE2_GPIO -1, -1, 60
# define RE3_GPIO -1, -1, 61
# define RE4_GPIO -1, -1, 62
# define RE5_GPIO -1, -1, 63
# define RE6_GPIO -1, -1, 64
# define RE7_GPIO -1, -1, 65
# define RF0_GPIO -1, -1, 68
# define RF1_GPIO -1, -1, 69
# define RF3_GPIO -1, -1, 71
# define RF4_GPIO -1, -1, 17
# define RF5_GPIO -1, -1, 18
# define RG6_GPIO -1, -1, 8
# define RG7_GPIO -1, -1, 9
# define RG8_GPIO -1, -1, 10
# define RG9_GPIO -1, -1, 11
#elif defined(__PIC24FJ128gb106__)
# define RB0_GPIO 0, 0, 2
# define RB1_GPIO 1, 1, 3
# define RB2_GPIO 13, 2, 4
# define RB3_GPIO -1, 3, 5
# define RB4_GPIO 28, 4, 6
# define RB5_GPIO 18, 5, 7
# define RB6_GPIO 6, 6, 24
# define RB7_GPIO 7, 7, 25
# define RB8_GPIO 8, 8, 26
# define RB9_GPIO 9, 9, 27
# define RB10_GPIO -1, 10, 28
# define RB11_GPIO -1, 11, 29
# define RB12_GPIO -1, 12, 30
# define RB13_GPIO -1, 13, 31
# define RB14_GPIO 14, 14, 32
# define RB15_GPIO 29, 15, 12
# define RC12_GPIO -1, -1, 23
# define RC13_GPIO -1, -1, 1
# define RC14_GPIO -1, -1, 0
# define RC15_GPIO -1, -1, 22
# define RD0_GPIO -1, -1, 49
# define RD1_GPIO -1, -1, 50
# define RD2_GPIO -1, -1, 51
# define RD3_GPIO -1, -1, 52
# define RD4_GPIO -1, -1, 13
# define RD5_GPIO -1, -1, 14
# define RD6_GPIO -1, -1, 15
# define RD7_GPIO -1, -1, 16
# define RD8_GPIO -1, -1, 53
# define RD9_GPIO -1, -1, 54
# define RD10_GPIO -1, -1, 55
# define RD11_GPIO -1, -1, 56
# define RE0_GPIO -1, -1, 58
# define RE1_GPIO -1, -1, 59
# define RE2_GPIO -1, -1, 60
# define RE3_GPIO -1, -1, 61
# define RE4_GPIO -1, -1, 62
# define RE5_GPIO -1, -1, 63
# define RE6_GPIO -1, -1, 64
# define RE7_GPIO -1, -1, 65
# define RF0_GPIO -1, -1, 68
# define RF1_GPIO -1, -1, 69
# define RF3_GPIO -1, -1, 71
# define RF4_GPIO -1, -1, 17
# define RF5_GPIO -1, -1, 18
# define RG6_GPIO -1, -1, 8
# define RG7_GPIO -1, -1, 9
# define RG8_GPIO -1, -1, 10
# define RG9_GPIO -1, -1, 11
#elif defined(__PIC24FJ192gb106__)
# define RB0_GPIO 0, 0, 2
# define RB1_GPIO 1, 1, 3
# define RB2_GPIO 13, 2, 4
# define RB3_GPIO -1, 3, 5
# define RB4_GPIO 28, 4, 6
# define RB5_GPIO 18, 5, 7
# define RB6_GPIO 6, 6, 24
# define RB7_GPIO 7, 7, 25
# define RB8_GPIO 8, 8, 26
# define RB9_GPIO 9, 9, 27
# define RB10_GPIO -1, 10, 28
# define RB11_GPIO -1, 11, 29
# define RB12_GPIO -1, 12, 30
# define RB13_GPIO -1, 13, 31
# define RB14_GPIO 14, 14, 32
# define RB15_GPIO 29, 15, 12
# define RC12_GPIO -1, -1, 23
# define RC13_GPIO -1, -1, 1
# define RC14_GPIO -1, -1, 0
# define RC15_GPIO -1, -1, 22
# define RD0_GPIO -1, -1, 49
# define RD1_GPIO -1, -1, 50
# define RD2_GPIO -1, -1, 51
# define RD3_GPIO -1, -1, 52
# define RD4_GPIO -1, -1, 13
# define RD5_GPIO -1, -1, 14
# define RD6_GPIO -1, -1, 15
# define RD7_GPIO -1, -1, 16
# define RD8_GPIO -1, -1, 53
# define RD9_GPIO -1, -1, 54
# define RD10_GPIO -1, -1, 55
# define RD11_GPIO -1, -1, 56
# define RE0_GPIO -1, -1, 58
# define RE1_GPIO -1, -1, 59
# define RE2_GPIO -1, -1, 60
# define RE3_GPIO -1, -1, 61
# define RE4_GPIO -1, -1, 62
# define RE5_GPIO -1, -1, 63
# define RE6_GPIO -1, -1, 64
# define RE7_GPIO -1, -1, 65
# define RF0_GPIO -1, -1, 68
# define RF1_GPIO -1, -1, 69
# define RF3_GPIO -1, -1, 71
# define RF4_GPIO -1, -1, 17
# define RF5_GPIO -1, -1, 18
# define RG6_GPIO -1, -1, 8
# define RG7_GPIO -1, -1, 9
# define RG8_GPIO -1, -1, 10
# define RG9_GPIO -1, -1, 11
#elif defined(__PIC24FJ256gb106__)
# define RB0_GPIO 0, 0, 2
# define RB1_GPIO 1, 1, 3
# define RB2_GPIO 13, 2, 4
# define RB3_GPIO -1, 3, 5
# define RB4_GPIO 28, 4, 6
# define RB5_GPIO 18, 5, 7
# define RB6_GPIO 6, 6, 24
# define RB7_GPIO 7, 7, 25
# define RB8_GPIO 8, 8, 26
# define RB9_GPIO 9, 9, 27
# define RB10_GPIO -1, 10, 28
# define RB11_GPIO -1, 11, 29
# define RB12_GPIO -1, 12, 30
# define RB13_GPIO -1, 13, 31
# define RB14_GPIO 14, 14, 32
# define RB15_GPIO 29, 15, 12
# define RC12_GPIO -1, -1, 23
# define RC13_GPIO -1, -1, 1
# define RC14_GPIO -1, -1, 0
# define RC15_GPIO -1, -1, 22
# define RD0_GPIO -1, -1, 49
# define RD1_GPIO -1, -1, 50
# define RD2_GPIO -1, -1, 51
# define RD3_GPIO -1, -1, 52
# define RD4_GPIO -1, -1, 13
# define RD5_GPIO -1, -1, 14
# define RD6_GPIO -1, -1, 15
# define RD7_GPIO -1, -1, 16
# define RD8_GPIO -1, -1, 53
# define RD9_GPIO -1, -1, 54
# define RD10_GPIO -1, -1, 55
# define RD11_GPIO -1, -1, 56
# define RE0_GPIO -1, -1, 58
# define RE1_GPIO -1, -1, 59
# define RE2_GPIO -1, -1, 60
# define RE3_GPIO -1, -1, 61
# define RE4_GPIO -1, -1, 62
# define RE5_GPIO -1, -1, 63
# define RE6_GPIO -1, -1, 64
# define RE7_GPIO -1, -1, 65
# define RF0_GPIO -1, -1, 68
# define RF1_GPIO -1, -1, 69
# define RF3_GPIO -1, -1, 71
# define RF4_GPIO -1, -1, 17
# define RF5_GPIO -1, -1, 18
# define RG6_GPIO -1, -1, 8
# define RG7_GPIO -1, -1, 9
# define RG8_GPIO -1, -1, 10
# define RG9_GPIO -1, -1, 11
#elif defined(__PIC24FJ128ga110__)
# define RA0_GPIO -1, -1, 33
# define RA1_GPIO -1, -1, 34
# define RA2_GPIO -1, -1, 35
# define RA3_GPIO -1, -1, 36
# define RA4_GPIO -1, -1, 37
# define RA5_GPIO -1, -1, 38
# define RA6_GPIO -1, -1, 39
# define RA7_GPIO -1, -1, 40
# define RA9_GPIO -1, -1, 41
# define RA10_GPIO -1, -1, 42
# define RA14_GPIO -1, -1, 43
# define RA15_GPIO -1, -1, 44
# define RB0_GPIO 0, 0, 2
# define RB1_GPIO 1, 1, 3
# define RB2_GPIO 13, 2, 4
# define RB3_GPIO -1, 3, 5
# define RB4_GPIO 28, 4, 6
# define RB5_GPIO 18, 5, 7
# define RB6_GPIO 6, 6, 24
# define RB7_GPIO 7, 7, 25
# define RB8_GPIO 8, 8, 26
# define RB9_GPIO 9, 9, 27
# define RB10_GPIO -1, 10, 28
# define RB11_GPIO -1, 11, 29
# define RB12_GPIO -1, 12, 30
# define RB13_GPIO -1, 13, 31
# define RB14_GPIO 14, 14, 32
# define RB15_GPIO 29, 15, 12
# define RC1_GPIO -1, -1, 45
# define RC2_GPIO -1, -1, 46
# define RC3_GPIO -1, -1, 47
# define RC4_GPIO -1, -1, 48
# define RC12_GPIO -1, -1, 23
# define RC13_GPIO -1, -1, 1
# define RC14_GPIO -1, -1, 0
# define RC15_GPIO -1, -1, 22
# define RD0_GPIO -1, -1, 49
# define RD1_GPIO -1, -1, 50
# define RD2_GPIO -1, -1, 51
# define RD3_GPIO -1, -1, 52
# define RD4_GPIO -1, -1, 13
# define RD5_GPIO -1, -1, 14
# define RD6_GPIO -1, -1, 15
# define RD7_GPIO -1, -1, 16
# define RD8_GPIO -1, -1, 53
# define RD9_GPIO -1, -1, 54
# define RD10_GPIO -1, -1, 55
# define RD11_GPIO -1, -1, 56
# define RD12_GPIO -1, -1, 57
# define RD13_GPIO -1, -1, 19
# define RD14_GPIO -1, -1, 20
# define RD15_GPIO -1, -1, 21
# define RE0_GPIO -1, -1, 58
# define RE1_GPIO -1, -1, 59
# define RE2_GPIO -1, -1, 60
# define RE3_GPIO -1, -1, 61
# define RE4_GPIO -1, -1, 62
# define RE5_GPIO -1, -1, 63
# define RE6_GPIO -1, -1, 64
# define RE7_GPIO -1, -1, 65
# define RE8_GPIO -1, -1, 66
# define RE9_GPIO -1, -1, 67
# define RF0_GPIO -1, -1, 68
# define RF1_GPIO -1, -1, 69
# define RF2_GPIO -1, -1, 70
# define RF3_GPIO -1, -1, 71
# define RF4_GPIO -1, -1, 17
# define RF5_GPIO -1, -1, 18
# define RF6_GPIO -1, -1, 72
# define RF7_GPIO -1, -1, 73
# define RF8_GPIO -1, -1, 74
# define RF12_GPIO -1, -1, 75
# define RF13_GPIO -1, -1, 76
# define RG0_GPIO -1, -1, 77
# define RG1_GPIO -1, -1, 78
# define RG2_GPIO -1, -1, 83
# define RG3_GPIO -1, -1, 84
# define RG6_GPIO -1, -1, 8
# define RG7_GPIO -1, -1, 9
# define RG8_GPIO -1, -1, 10
# define RG9_GPIO -1, -1, 11
# define RG12_GPIO -1, -1, 79
# define RG13_GPIO -1, -1, 80
# define RG14_GPIO -1, -1, 81
# define RG15_GPIO -1, -1, 82
#elif defined(__PIC24FJ192ga110__)
# define RA0_GPIO -1, -1, 33
# define RA1_GPIO -1, -1, 34
# define RA2_GPIO -1, -1, 35
# define RA3_GPIO -1, -1, 36
# define RA4_GPIO -1, -1, 37
# define RA5_GPIO -1, -1, 38
# define RA6_GPIO -1, -1, 39
# define RA7_GPIO -1, -1, 40
# define RA9_GPIO -1, -1, 41
# define RA10_GPIO -1, -1, 42
# define RA14_GPIO -1, -1, 43
# define RA15_GPIO -1, -1, 44
# define RB0_GPIO 0, 0, 2
# define RB1_GPIO 1, 1, 3
# define RB2_GPIO 13, 2, 4
# define RB3_GPIO -1, 3, 5
# define RB4_GPIO 28, 4, 6
# define RB5_GPIO 18, 5, 7
# define RB6_GPIO 6, 6, 24
# define RB7_GPIO 7, 7, 25
# define RB8_GPIO 8, 8, 26
# define RB9_GPIO 9, 9, 27
# define RB10_GPIO -1, 10, 28
# define RB11_GPIO -1, 11, 29
# define RB12_GPIO -1, 12, 30
# define RB13_GPIO -1, 13, 31
# define RB14_GPIO 14, 14, 32
# define RB15_GPIO 29, 15, 12
# define RC1_GPIO -1, -1, 45
# define RC2_GPIO -1, -1, 46
# define RC3_GPIO -1, -1, 47
# define RC4_GPIO -1, -1, 48
# define RC12_GPIO -1, -1, 23
# define RC13_GPIO -1, -1, 1
# define RC14_GPIO -1, -1, 0
# define RC15_GPIO -1, -1, 22
# define RD0_GPIO -1, -1, 49
# define RD1_GPIO -1, -1, 50
# define RD2_GPIO -1, -1, 51
# define RD3_GPIO -1, -1, 52
# define RD4_GPIO -1, -1, 13
# define RD5_GPIO -1, -1, 14
# define RD6_GPIO -1, -1, 15
# define RD7_GPIO -1, -1, 16
# define RD8_GPIO -1, -1, 53
# define RD9_GPIO -1, -1, 54
# define RD10_GPIO -1, -1, 55
# define RD11_GPIO -1, -1, 56
# define RD12_GPIO -1, -1, 57
# define RD13_GPIO -1, -1, 19
# define RD14_GPIO -1, -1, 20
# define RD15_GPIO -1, -1, 21
# define RE0_GPIO -1, -1, 58
# define RE1_GPIO -1, -1, 59
# define RE2_GPIO -1, -1, 60
# define RE3_GPIO -1, -1, 61
# define RE4_GPIO -1, -1, 62
# define RE5_GPIO -1, -1, 63
# define RE6_GPIO -1, -1, 64
# define RE7_GPIO -1, -1, 65
# define RE8_GPIO -1, -1, 66
# define RE9_GPIO -1, -1, 67
# define RF0_GPIO -1, -1, 68
# define RF1_GPIO -1, -1, 69
# define RF2_GPIO -1, -1, 70
# define RF3_GPIO -1, -1, 71
# define RF4_GPIO -1, -1, 17
# define RF5_GPIO -1, -1, 18
# define RF6_GPIO -1, -1, 72
# define RF7_GPIO -1, -1, 73
# define RF8_GPIO -1, -1, 74
# define RF12_GPIO -1, -1, 75
# define RF13_GPIO -1, -1, 76
# define RG0_GPIO -1, -1, 77
# define RG1_GPIO -1, -1, 78
# define RG2_GPIO -1, -1, 83
# define RG3_GPIO -1, -1, 84
# define RG6_GPIO -1, -1, 8
# define RG7_GPIO -1, -1, 9
# define RG8_GPIO -1, -1, 10
# define RG9_GPIO -1, -1, 11
# define RG12_GPIO -1, -1, 79
# define RG13_GPIO -1, -1, 80
# define RG14_GPIO -1, -1, 81
# define RG15_GPIO -1, -1, 82
#elif defined(__PIC24FJ256ga110__)
# define RA0_GPIO -1, -1, 33
# define RA1_GPIO -1, -1, 34
# define RA2_GPIO -1, -1, 35
# define RA3_GPIO -1, -1, 36
# define RA4_GPIO -1, -1, 37
# define RA5_GPIO -1, -1, 38
# define RA6_GPIO -1, -1, 39
# define RA7_GPIO -1, -1, 40
# define RA9_GPIO -1, -1, 41
# define RA10_GPIO -1, -1, 42
# define RA14_GPIO -1, -1, 43
# define RA15_GPIO -1, -1, 44
# define RB0_GPIO 0, 0, 2
# define RB1_GPIO 1, 1, 3
# define RB2_GPIO 13, 2, 4
# define RB3_GPIO -1, 3, 5
# define RB4_GPIO 28, 4, 6
# define RB5_GPIO 18, 5, 7
# define RB6_GPIO 6, 6, 24
# define RB7_GPIO 7, 7, 25
# define RB8_GPIO 8, 8, 26
# define RB9_GPIO 9, 9, 27
# define RB10_GPIO -1, 10, 28
# define RB11_GPIO -1, 11, 29
# define RB12_GPIO -1, 12, 30
# define RB13_GPIO -1, 13, 31
# define RB14_GPIO 14, 14, 32
# define RB15_GPIO 29, 15, 12
# define RC1_GPIO -1, -1, 45
# define RC2_GPIO -1, -1, 46
# define RC3_GPIO -1, -1, 47
# define RC4_GPIO -1, -1, 48
# define RC12_GPIO -1, -1, 23
# define RC13_GPIO -1, -1, 1
# define RC14_GPIO -1, -1, 0
# define RC15_GPIO -1, -1, 22
# define RD0_GPIO -1, -1, 49
# define RD1_GPIO -1, -1, 50
# define RD2_GPIO -1, -1, 51
# define RD3_GPIO -1, -1, 52
# define RD4_GPIO -1, -1, 13
# define RD5_GPIO -1, -1, 14
# define RD6_GPIO -1, -1, 15
# define RD7_GPIO -1, -1, 16
# define RD8_GPIO -1, -1, 53
# define RD9_GPIO -1, -1, 54
# define RD10_GPIO -1, -1, 55
# define RD11_GPIO -1, -1, 56
# define RD12_GPIO -1, -1, 57
# define RD13_GPIO -1, -1, 19
# define RD14_GPIO -1, -1, 20
# define RD15_GPIO -1, -1, 21
# define RE0_GPIO -1, -1, 58
# define RE1_GPIO -1, -1, 59
# define RE2_GPIO -1, -1, 60
# define RE3_GPIO -1, -1, 61
# define RE4_GPIO -1, -1, 62
# define RE5_GPIO -1, -1, 63
# define RE6_GPIO -1, -1, 64
# define RE7_GPIO -1, -1, 65
# define RE8_GPIO -1, -1, 66
# define RE9_GPIO -1, -1, 67
# define RF0_GPIO -1, -1, 68
# define RF1_GPIO -1, -1, 69
# define RF2_GPIO -1, -1, 70
# define RF3_GPIO -1, -1, 71
# define RF4_GPIO -1, -1, 17
# define RF5_GPIO -1, -1, 18
# define RF6_GPIO -1, -1, 72
# define RF7_GPIO -1, -1, 73
# define RF8_GPIO -1, -1, 74
# define RF12_GPIO -1, -1, 75
# define RF13_GPIO -1, -1, 76
# define RG0_GPIO -1, -1, 77
# define RG1_GPIO -1, -1, 78
# define RG2_GPIO -1, -1, 83
# define RG3_GPIO -1, -1, 84
# define RG6_GPIO -1, -1, 8
# define RG7_GPIO -1, -1, 9
# define RG8_GPIO -1, -1, 10
# define RG9_GPIO -1, -1, 11
# define RG12_GPIO -1, -1, 79
# define RG13_GPIO -1, -1, 80
# define RG14_GPIO -1, -1, 81
# define RG15_GPIO -1, -1, 82
#elif defined(__PIC24FJ64ga010__)
# define RB0_GPIO -1, 0, 2
# define RB1_GPIO -1, 1, 3
# define RB2_GPIO -1, 2, 4
# define RB3_GPIO -1, 3, 5
# define RB4_GPIO -1, 4, 6
# define RB5_GPIO -1, 5, 7
# define RB6_GPIO -1, 6, -1
# define RB7_GPIO -1, 7, -1
# define RB8_GPIO -1, 8, -1
# define RB9_GPIO -1, 9, -1
# define RB10_GPIO -1, 10, -1
# define RB11_GPIO -1, 11, -1
# define RB12_GPIO -1, 12, -1
# define RB13_GPIO -1, 13, -1
# define RB14_GPIO -1, 14, -1
# define RB15_GPIO -1, 15, 12
# define RC13_GPIO -1, -1, 1
# define RC14_GPIO -1, -1, 0
# define RD4_GPIO -1, -1, 13
# define RD5_GPIO -1, -1, 14
# define RD6_GPIO -1, -1, 15
# define RD7_GPIO -1, -1, 16
# define RD13_GPIO -1, -1, 19
# define RD14_GPIO -1, -1, 20
# define RD15_GPIO -1, -1, 21
# define RF4_GPIO -1, -1, 17
# define RF5_GPIO -1, -1, 18
# define RG6_GPIO -1, -1, 8
# define RG7_GPIO -1, -1, 9
# define RG8_GPIO -1, -1, 10
# define RG9_GPIO -1, -1, 11
#elif defined(__PIC24FJ96ga010__)
# define RB0_GPIO -1, 0, 2
# define RB1_GPIO -1, 1, 3
# define RB2_GPIO -1, 2, 4
# define RB3_GPIO -1, 3, 5
# define RB4_GPIO -1, 4, 6
# define RB5_GPIO -1, 5, 7
# define RB6_GPIO -1, 6, -1
# define RB7_GPIO -1, 7, -1
# define RB8_GPIO -1, 8, -1
# define RB9_GPIO -1, 9, -1
# define RB10_GPIO -1, 10, -1
# define RB11_GPIO -1, 11, -1
# define RB12_GPIO -1, 12, -1
# define RB13_GPIO -1, 13, -1
# define RB14_GPIO -1, 14, -1
# define RB15_GPIO -1, 15, 12
# define RC13_GPIO -1, -1, 1
# define RC14_GPIO -1, -1, 0
# define RD4_GPIO -1, -1, 13
# define RD5_GPIO -1, -1, 14
# define RD6_GPIO -1, -1, 15
# define RD7_GPIO -1, -1, 16
# define RD13_GPIO -1, -1, 19
# define RD14_GPIO -1, -1, 20
# define RD15_GPIO -1, -1, 21
# define RF4_GPIO -1, -1, 17
# define RF5_GPIO -1, -1, 18
# define RG6_GPIO -1, -1, 8
# define RG7_GPIO -1, -1, 9
# define RG8_GPIO -1, -1, 10
# define RG9_GPIO -1, -1, 11
#elif defined(__PIC24FJ128ga010__)
# define RB0_GPIO -1, 0, 2
# define RB1_GPIO -1, 1, 3
# define RB2_GPIO -1, 2, 4
# define RB3_GPIO -1, 3, 5
# define RB4_GPIO -1, 4, 6
# define RB5_GPIO -1, 5, 7
# define RB6_GPIO -1, 6, -1
# define RB7_GPIO -1, 7, -1
# define RB8_GPIO -1, 8, -1
# define RB9_GPIO -1, 9, -1
# define RB10_GPIO -1, 10, -1
# define RB11_GPIO -1, 11, -1
# define RB12_GPIO -1, 12, -1
# define RB13_GPIO -1, 13, -1
# define RB14_GPIO -1, 14, -1
# define RB15_GPIO -1, 15, 12
# define RC13_GPIO -1, -1, 1
# define RC14_GPIO -1, -1, 0
# define RD4_GPIO -1, -1, 13
# define RD5_GPIO -1, -1, 14
# define RD6_GPIO -1, -1, 15
# define RD7_GPIO -1, -1, 16
# define RD13_GPIO -1, -1, 19
# define RD14_GPIO -1, -1, 20
# define RD15_GPIO -1, -1, 21
# define RF4_GPIO -1, -1, 17
# define RF5_GPIO -1, -1, 18
# define RG6_GPIO -1, -1, 8
# define RG7_GPIO -1, -1, 9
# define RG8_GPIO -1, -1, 10
# define RG9_GPIO -1, -1, 11
#elif defined(__PIC24FJ64gb110__)
# define RA0_GPIO -1, -1, 33
# define RA1_GPIO -1, -1, 34
# define RA2_GPIO -1, -1, 35
# define RA3_GPIO -1, -1, 36
# define RA4_GPIO -1, -1, 37
# define RA5_GPIO -1, -1, 38
# define RA6_GPIO -1, -1, 39
# define RA7_GPIO -1, -1, 40
# define RA9_GPIO -1, -1, 41
# define RA10_GPIO -1, -1, 42
# define RA14_GPIO -1, -1, 43
# define RA15_GPIO -1, -1, 44
# define RB0_GPIO 0, 0, 2
# define RB1_GPIO 1, 1, 3
# define RB2_GPIO 13, 2, 4
# define RB3_GPIO -1, 3, 5
# define RB4_GPIO 28, 4, 6
# define RB5_GPIO 18, 5, 7
# define RB6_GPIO 6, 6, 24
# define RB7_GPIO 7, 7, 25
# define RB8_GPIO 8, 8, 26
# define RB9_GPIO 9, 9, 27
# define RB10_GPIO -1, 10, 28
# define RB11_GPIO -1, 11, 29
# define RB12_GPIO -1, 12, 30
# define RB13_GPIO -1, 13, 31
# define RB14_GPIO 14, 14, 32
# define RB15_GPIO 29, 15, 12
# define RC1_GPIO -1, -1, 45
# define RC2_GPIO -1, -1, 46
# define RC3_GPIO -1, -1, 47
# define RC4_GPIO -1, -1, 48
# define RC12_GPIO -1, -1, 23
# define RC13_GPIO -1, -1, 1
# define RC14_GPIO -1, -1, 0
# define RC15_GPIO -1, -1, 22
# define RD0_GPIO -1, -1, 49
# define RD1_GPIO -1, -1, 50
# define RD2_GPIO -1, -1, 51
# define RD3_GPIO -1, -1, 52
# define RD4_GPIO -1, -1, 13
# define RD5_GPIO -1, -1, 14
# define RD6_GPIO -1, -1, 15
# define RD7_GPIO -1, -1, 16
# define RD8_GPIO -1, -1, 53
# define RD9_GPIO -1, -1, 54
# define RD10_GPIO -1, -1, 55
# define RD11_GPIO -1, -1, 56
# define RD12_GPIO -1, -1, 57
# define RD13_GPIO -1, -1, 19
# define RD14_GPIO -1, -1, 20
# define RD15_GPIO -1, -1, 21
# define RE0_GPIO -1, -1, 58
# define RE1_GPIO -1, -1, 59
# define RE2_GPIO -1, -1, 60
# define RE3_GPIO -1, -1, 61
# define RE4_GPIO -1, -1, 62
# define RE5_GPIO -1, -1, 63
# define RE6_GPIO -1, -1, 64
# define RE7_GPIO -1, -1, 65
# define RE8_GPIO -1, -1, 66
# define RE9_GPIO -1, -1, 67
# define RF0_GPIO -1, -1, 68
# define RF1_GPIO -1, -1, 69
# define RF2_GPIO -1, -1, 70
# define RF3_GPIO -1, -1, 71
# define RF4_GPIO -1, -1, 17
# define RF5_GPIO -1, -1, 18
# define RF8_GPIO -1, -1, 74
# define RF12_GPIO -1, -1, 75
# define RF13_GPIO -1, -1, 76
# define RG0_GPIO -1, -1, 77
# define RG1_GPIO -1, -1, 78
# define RG6_GPIO -1, -1, 8
# define RG7_GPIO -1, -1, 9
# define RG8_GPIO -1, -1, 10
# define RG9_GPIO -1, -1, 11
# define RG12_GPIO -1, -1, 79
# define RG13_GPIO -1, -1, 80
# define RG14_GPIO -1, -1, 81
# define RG15_GPIO -1, -1, 82
#elif defined(__PIC24FJ128gb110__)
# define RA0_GPIO -1, -1, 33
# define RA1_GPIO -1, -1, 34
# define RA2_GPIO -1, -1, 35
# define RA3_GPIO -1, -1, 36
# define RA4_GPIO -1, -1, 37
# define RA5_GPIO -1, -1, 38
# define RA6_GPIO -1, -1, 39
# define RA7_GPIO -1, -1, 40
# define RA9_GPIO -1, -1, 41
# define RA10_GPIO -1, -1, 42
# define RA14_GPIO -1, -1, 43
# define RA15_GPIO -1, -1, 44
# define RB0_GPIO 0, 0, 2
# define RB1_GPIO 1, 1, 3
# define RB2_GPIO 13, 2, 4
# define RB3_GPIO -1, 3, 5
# define RB4_GPIO 28, 4, 6
# define RB5_GPIO 18, 5, 7
# define RB6_GPIO 6, 6, 24
# define RB7_GPIO 7, 7, 25
# define RB8_GPIO 8, 8, 26
# define RB9_GPIO 9, 9, 27
# define RB10_GPIO -1, 10, 28
# define RB11_GPIO -1, 11, 29
# define RB12_GPIO -1, 12, 30
# define RB13_GPIO -1, 13, 31
# define RB14_GPIO 14, 14, 32
# define RB15_GPIO 29, 15, 12
# define RC1_GPIO -1, -1, 45
# define RC2_GPIO -1, -1, 46
# define RC3_GPIO -1, -1, 47
# define RC4_GPIO -1, -1, 48
# define RC12_GPIO -1, -1, 23
# define RC13_GPIO -1, -1, 1
# define RC14_GPIO -1, -1, 0
# define RC15_GPIO -1, -1, 22
# define RD0_GPIO -1, -1, 49
# define RD1_GPIO -1, -1, 50
# define RD2_GPIO -1, -1, 51
# define RD3_GPIO -1, -1, 52
# define RD4_GPIO -1, -1, 13
# define RD5_GPIO -1, -1, 14
# define RD6_GPIO -1, -1, 15
# define RD7_GPIO -1, -1, 16
# define RD8_GPIO -1, -1, 53
# define RD9_GPIO -1, -1, 54
# define RD10_GPIO -1, -1, 55
# define RD11_GPIO -1, -1, 56
# define RD12_GPIO -1, -1, 57
# define RD13_GPIO -1, -1, 19
# define RD14_GPIO -1, -1, 20
# define RD15_GPIO -1, -1, 21
# define RE0_GPIO -1, -1, 58
# define RE1_GPIO -1, -1, 59
# define RE2_GPIO -1, -1, 60
# define RE3_GPIO -1, -1, 61
# define RE4_GPIO -1, -1, 62
# define RE5_GPIO -1, -1, 63
# define RE6_GPIO -1, -1, 64
# define RE7_GPIO -1, -1, 65
# define RE8_GPIO -1, -1, 66
# define RE9_GPIO -1, -1, 67
# define RF0_GPIO -1, -1, 68
# define RF1_GPIO -1, -1, 69
# define RF2_GPIO -1, -1, 70
# define RF3_GPIO -1, -1, 71
# define RF4_GPIO -1, -1, 17
# define RF5_GPIO -1, -1, 18
# define RF8_GPIO -1, -1, 74
# define RF12_GPIO -1, -1, 75
# define RF13_GPIO -1, -1, 76
# define RG0_GPIO -1, -1, 77
# define RG1_GPIO -1, -1, 78
# define RG6_GPIO -1, -1, 8
# define RG7_GPIO -1, -1, 9
# define RG8_GPIO -1, -1, 10
# define RG9_GPIO -1, -1, 11
# define RG12_GPIO -1, -1, 79
# define RG13_GPIO -1, -1, 80
# define RG14_GPIO -1, -1, 81
# define RG15_GPIO -1, -1, 82
#elif defined(__PIC24FJ192gb110__)
# define RA0_GPIO -1, -1, 33
# define RA1_GPIO -1, -1, 34
# define RA2_GPIO -1, -1, 35
# define RA3_GPIO -1, -1, 36
# define RA4_GPIO -1, -1, 37
# define RA5_GPIO -1, -1, 38
# define RA6_GPIO -1, -1, 39
# define RA7_GPIO -1, -1, 40
# define RA9_GPIO -1, -1, 41
# define RA10_GPIO -1, -1, 42
# define RA14_GPIO -1, -1, 43
# define RA15_GPIO -1, -1, 44
# define RB0_GPIO 0, 0, 2
# define RB1_GPIO 1, 1, 3
# define RB2_GPIO 13, 2, 4
# define RB3_GPIO -1, 3, 5
# define RB4_GPIO 28, 4, 6
# define RB5_GPIO 18, 5, 7
# define RB6_GPIO 6, 6, 24
# define RB7_GPIO 7, 7, 25
# define RB8_GPIO 8, 8, 26
# define RB9_GPIO 9, 9, 27
# define RB10_GPIO -1, 10, 28
# define RB11_GPIO -1, 11, 29
# define RB12_GPIO -1, 12, 30
# define RB13_GPIO -1, 13, 31
# define RB14_GPIO 14, 14, 32
# define RB15_GPIO 29, 15, 12
# define RC1_GPIO -1, -1, 45
# define RC2_GPIO -1, -1, 46
# define RC3_GPIO -1, -1, 47
# define RC4_GPIO -1, -1, 48
# define RC12_GPIO -1, -1, 23
# define RC13_GPIO -1, -1, 1
# define RC14_GPIO -1, -1, 0
# define RC15_GPIO -1, -1, 22
# define RD0_GPIO -1, -1, 49
# define RD1_GPIO -1, -1, 50
# define RD2_GPIO -1, -1, 51
# define RD3_GPIO -1, -1, 52
# define RD4_GPIO -1, -1, 13
# define RD5_GPIO -1, -1, 14
# define RD6_GPIO -1, -1, 15
# define RD7_GPIO -1, -1, 16
# define RD8_GPIO -1, -1, 53
# define RD9_GPIO -1, -1, 54
# define RD10_GPIO -1, -1, 55
# define RD11_GPIO -1, -1, 56
# define RD12_GPIO -1, -1, 57
